{
  "timestamp": "2026-01-19T13:33:14.056260",
  "key": "source_e27_7days",
  "value": [
    {
      "title": "Bitcoin crashes below US$93K as trade war fears wipe out US$357M in leverage",
      "url": "https://e27.co/bitcoin-crashes-below-us93k-as-trade-war-fears-wipe-out-us357m-in-leverage-20260119/",
      "content": "Global markets shifted sharply into risk-off mode as President Trump announced proposed 10 per cent tariffs on eight European countries that opposed US plans regarding Greenland. The move reignited trade-war anxieties, triggering a broad retreat from risk assets and sending haven assets to new highs. US equity index futures reflected the unease, with the S&P […]\nThe post Bitcoin crashes below US$93K as trade war fears wipe out US$357M in leverage appeared first on e27.",
      "published_date": "2026-01-19T04:57:39",
      "source": "e27 - Southeast Asia Tech Hub",
      "source_id": "e27",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 10,
      "focus_tags": [
        "东南亚创业",
        "融资新闻",
        "企业报道",
        "科技政策"
      ]
    },
    {
      "title": "When tech titans blink: 2025 exposed the Old Guard’s fragility",
      "url": "https://e27.co/when-tech-titans-blink-2025-exposed-the-old-guards-fragility-20260119/",
      "content": "The year 2025 was a brutal wake-up call for the “Old Guard” of the technology world. Giants like Intel and IBM, once the untouchable architects of the digital age, effected massive, painful restructurings to avoid obsolescence. The latest figures from UK-based forex company RationalFX paint a grim picture: Intel alone accounted for nearly 34,000 layoffs in 2025, […]\nThe post When tech titans blink: 2025 exposed the Old Guard’s fragility appeared first on e27.",
      "published_date": "2026-01-19T04:26:06",
      "source": "e27 - Southeast Asia Tech Hub",
      "source_id": "e27",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 10,
      "focus_tags": [
        "东南亚创业",
        "融资新闻",
        "企业报道",
        "科技政策"
      ]
    },
    {
      "title": "Super apps, fintech wallets and mobile payments: Southeast Asia’s next big cyber risk",
      "url": "https://e27.co/super-apps-fintech-wallets-and-mobile-payments-southeast-asias-next-big-cyber-risk-20260115/",
      "content": "Southeast Asia has become one of the world’s most active laboratories for mobile fintech innovation. Across Indonesia, Vietnam, the Philippines, Singapore and Malaysia, consumers increasingly rely on super apps and digital wallets for everything from food delivery to taxi rides to stock trading. This shift has been rapid and profound: digital payments penetration in the […]\nThe post Super apps, fintech wallets and mobile payments: Southeast Asia’s next big cyber risk appeared first on e27.",
      "published_date": "2026-01-19T02:30:28",
      "source": "e27 - Southeast Asia Tech Hub",
      "source_id": "e27",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 10,
      "focus_tags": [
        "东南亚创业",
        "融资新闻",
        "企业报道",
        "科技政策"
      ]
    },
    {
      "title": "How CCTV-based Vision AI minimises downtime in modern manufacturing",
      "url": "https://e27.co/how-cctv-based-vision-ai-minimises-downtime-in-modern-manufacturing-20260115/",
      "content": "Unplanned downtime remains a persistent challenge in manufacturing. Even a small fault in a production line can cascade into halted operations, delayed deliveries, and high costs. Traditional monitoring methods — manual inspections and basic sensors- often react too late or fail to detect subtle anomalies.  The downtime challenge  Unplanned downtime can occur due to machine […]\nThe post How CCTV-based Vision AI minimises downtime in modern manufacturing appeared first on e27.",
      "published_date": "2026-01-19T02:00:49",
      "source": "e27 - Southeast Asia Tech Hub",
      "source_id": "e27",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 10,
      "focus_tags": [
        "东南亚创业",
        "融资新闻",
        "企业报道",
        "科技政策"
      ]
    },
    {
      "title": "China’s rerouting boom: How major firms are bypassing the impact of US tariffs",
      "url": "https://e27.co/chinas-rerouting-boom-how-major-firms-are-bypassing-the-impact-of-us-tariffs-20260115/",
      "content": "While news of a trade deal struck between the United States and China will be welcome news for global trade, firms are continuing to seek out creative solutions in minimising export costs when it comes to shipping goods.  The announcement of the Trump administration’s reciprocal tariffs in April 2025 sent shockwaves throughout China, the world’s […]\nThe post China’s rerouting boom: How major firms are bypassing the impact of US tariffs appeared first on e27.",
      "published_date": "2026-01-19T01:30:24",
      "source": "e27 - Southeast Asia Tech Hub",
      "source_id": "e27",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 10,
      "focus_tags": [
        "东南亚创业",
        "融资新闻",
        "企业报道",
        "科技政策"
      ]
    },
    {
      "title": "The hidden margin killer: Why CFOs are rethinking cross-border payment infrastructure",
      "url": "https://e27.co/the-hidden-margin-killer-why-cfos-are-rethinking-cross-border-payment-infrastructure-20260116/",
      "content": "There’s a paradox at the heart of modern international business. We’ve digitised nearly every aspect of operations. Marketing runs on sophisticated attribution models. Sales teams use AI-powered CRMs. Supply chains are optimised down to the last mile. Yet when it comes to moving money across borders—one of the most fundamental business functions—most companies are still […]\nThe post The hidden margin killer: Why CFOs are rethinking cross-border payment infrastructure appeared first on e27.",
      "published_date": "2026-01-19T01:00:54",
      "source": "e27 - Southeast Asia Tech Hub",
      "source_id": "e27",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 10,
      "focus_tags": [
        "东南亚创业",
        "融资新闻",
        "企业报道",
        "科技政策"
      ]
    },
    {
      "title": "AI’s tipping point: Why 2026 will separate the leaders from the laggards in financial services",
      "url": "https://e27.co/ais-tipping-point-why-2026-will-separate-the-leaders-from-the-laggards-in-financial-services-20260115/",
      "content": "Over the past few years, AI in the enterprise has been about trials and piloting of new solutions. While over 70 per cent of banking institutions globally use agentic AI today, only 16 per cent have moved to actual operational deployment. This gap reveals a critical truth: the barrier to production scale is not technology. […]\nThe post AI’s tipping point: Why 2026 will separate the leaders from the laggards in financial services appeared first on e27.",
      "published_date": "2026-01-19T01:00:20",
      "source": "e27 - Southeast Asia Tech Hub",
      "source_id": "e27",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 10,
      "focus_tags": [
        "东南亚创业",
        "融资新闻",
        "企业报道",
        "科技政策"
      ]
    }
  ]
}