{
  "timestamp": "2026-01-19T13:33:17.073266",
  "key": "source_fintechnews_singapore_7days",
  "value": [
    {
      "title": "ACI Worldwide Appoints JP Krishnamoorthy as Tech and Innovation Chief",
      "url": "https://fintechnews.sg/124783/payments/aci-worldwide-jp-krishnamoorthy/",
      "content": "Payments software provider ACI Worldwide has appointed JP Krishnamoorthy as Chief Innovation and Technology Officer. Krishnamoorthy joined the company in December 2025 and has assumed leadership of ACI’s Global Technology and Innovation organisation. In the role, he will be responsible for advancing ACI’s technology strategy to support faster product delivery and more scalable payments services [...]\nThe post ACI Worldwide Appoints JP Krishnamoorthy as Tech and Innovation Chief appeared first on Fintech Singapore.",
      "published_date": "2026-01-19T05:28:26",
      "source": "Fintechnews Singapore",
      "source_id": "fintechnews_singapore",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 10,
      "focus_tags": [
        "新加坡",
        "金融科技",
        "支付创新",
        "AI银行",
        "东南亚"
      ]
    },
    {
      "title": "Sea Injects Another S$75 Million Into MariBank Amid Revenue Growth",
      "url": "https://fintechnews.sg/124740/digital-banking-news-singapore/sea-funding-maribank/",
      "content": "Singapore’s Sea Ltd has increased its investment in MariBank with a S$75 million capital injection, lifting the digital bank’s paid-up capital to about US$639 million. The funding was disclosed in regulatory filings and first reported by DealStreetAsia. The top-up comes after another shareholder injection in May 2025, when Sea added about US$78 million to MariBank’s [...]\nThe post Sea Injects Another S$75 Million Into MariBank Amid Revenue Growth appeared first on Fintech Singapore.",
      "published_date": "2026-01-19T02:49:57",
      "source": "Fintechnews Singapore",
      "source_id": "fintechnews_singapore",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 10,
      "focus_tags": [
        "新加坡",
        "金融科技",
        "支付创新",
        "AI银行",
        "东南亚"
      ]
    },
    {
      "title": "Fujitsu and SC Ventures Launch Qubitra to Advance Quantum Computing",
      "url": "https://fintechnews.sg/124748/fintech/fujitsu-sc-ventures-qubitra-launch/",
      "content": "Fujitsu Limited and SC Ventures have announced the launch of Qubitra Technologies. It is a joint venture aimed at advancing quantum computing applications and building a global quantum ecosystem. Previously incubated as Project Quanta in September 2025, Qubitra will operate from the UK. The company will focus on high-performance applications and a marketplace platform for [...]\nThe post Fujitsu and SC Ventures Launch Qubitra to Advance Quantum Computing appeared first on Fintech Singapore.",
      "published_date": "2026-01-19T02:18:12",
      "source": "Fintechnews Singapore",
      "source_id": "fintechnews_singapore",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 10,
      "focus_tags": [
        "新加坡",
        "金融科技",
        "支付创新",
        "AI银行",
        "东南亚"
      ]
    }
  ]
}