{
  "timestamp": "2026-01-06T11:28:48.500187",
  "key": "source_analyticsvidhya_7days",
  "value": [
    {
      "title": "30 Best Data Science Books to Read in 2026",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/best-data-science-books-to-read/",
      "content": "Data science powers decision-making across modern businesses, from data preparation and automation to advanced analytics and machine learning. Learning it requires a strong foundation in mathematics, statistics, programming, and practical problem-solving. The good news is that data science can be self-learned with the right resources and consistent practice. Books remain one of the most effective […]\nThe post 30 Best Data Science Books to Read in 2026 appeared first on Analytics Vidhya.",
      "published_date": "2026-01-05T18:39:00",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "How to Use Gemini 3 Pro in CLI?",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/gemini-3-pro-cli/",
      "content": "AI-based coding agents are changing developer workflows. Proof – the arrival of Gemini 3 Pro in the Gemini CLI. It shows a significant advancement. For instance, it provides advanced reasoning, enhanced tool usage, and natural-language coding right in the terminal. Developers will be able to generate, fix, and refactor code without needing to break their flow by […]\nThe post How to Use Gemini 3 Pro in CLI? appeared first on Analytics Vidhya.",
      "published_date": "2026-01-05T17:15:02",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "LangChain vs LangGraph vs LangSmith vs LangFlow: Choosing the Right LLM Toolkit",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/langchain-vs-langgraph-vs-langsmith-vs-langflow/",
      "content": "The LangChain ecosystem provides an important set of tools with which to construct an application using Large Language Models (LLMs). However, when the names of the companies such as LangChain, LangGraph, LangSmith, and LangFlow are mentioned, it is often difficult to know where to begin. This is a guide that shows an easy way around […]\nThe post LangChain vs LangGraph vs LangSmith vs LangFlow: Choosing the Right LLM Toolkit appeared first on Analytics Vidhya.",
      "published_date": "2026-01-05T12:04:52",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "How to Structure Your Data Science Project (With Frameworks & Best Practices)",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/data-science-project-structure/",
      "content": "Ever felt lost in messy folders, so many scripts, and unorganized code? That chaos only slows you down and hardens the data science journey. Organized workflows and project structures are not just nice-to-have, because it affects the reproducibility, collaboration and understanding of what’s happening in the project. In this blog, we’ll explore the best practices plus look at a sample project […]\nThe post How to Structure Your Data Science Project (With Frameworks & Best Practices) appeared first on Analytics Vidhya.",
      "published_date": "2026-01-04T04:48:00",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "DeepSeek mHC: Stabilizing Large Language Model Training",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/deepseek-mhc/",
      "content": "Large AI models are scaling rapidly, with bigger architectures and longer training runs becoming the norm. As models grow, however, a fundamental training stability issue has remained unresolved. DeepSeek mHC directly addresses this problem by rethinking how residual connections behave at scale. This article explains DeepSeek mHC (Manifold-Constrained Hyper-Connections) and shows how it improves large language model training stability […]\nThe post DeepSeek mHC: Stabilizing Large Language Model Training appeared first on Analytics Vidhya.",
      "published_date": "2026-01-03T05:57:25",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "15 AI Agents Trends to Watch in 2026",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/ai-agents-trends/",
      "content": "The bygone year has been an interesting one, especially so for the age of AI that is fast coming. We saw AI agents rise for the first time and take over repetitive tasks that traditionally required a human workforce. However, in 2025, most AI agents still lived inside demos, copilots, and experimental workflows. With the […]\nThe post 15 AI Agents Trends to Watch in 2026 appeared first on Analytics Vidhya.",
      "published_date": "2026-01-03T03:55:18",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Top 18 Power BI Project Ideas For Practice 2026",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/top-power-bi-project/",
      "content": "Power BI is an influential tool, shaping raw data into informative visuals and reports. With a user-friendly interface and formidable functionalities, Power BI is an invaluable platform for individuals to refine their skills through hands-on projects. By engaging in Power BI practice projects, beginners and experts can significantly augment their prowess. In this article, we […]\nThe post Top 18 Power BI Project Ideas For Practice 2026 appeared first on Analytics Vidhya.",
      "published_date": "2026-01-02T12:23:08",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Preference Fine-Tuning LFM 2 Using DPO",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/lfm-2-preference-fine-tuning-using-dpo/",
      "content": "Liquid Foundation Models (LFM 2) define a new class of small language models designed to deliver strong reasoning and instruction-following capabilities directly on edge devices. Unlike large cloud-centric LLMs, LFM 2 focuses on efficiency, low latency, and memory awareness while still maintaining competitive performance. This design makes it a compelling choice for applications on mobile […]\nThe post Preference Fine-Tuning LFM 2 Using DPO appeared first on Analytics Vidhya.",
      "published_date": "2026-01-02T12:10:26",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Google T5Gemma-2 Explained: Trying Out a Laptop-Friendly Multimodal AI Model",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/google-t5gemma-2/",
      "content": "Google just dropped T5Gemma-2, and it is a game-changer for someone working with AI models on everyday hardware. Built on the Gemma 3 family, this encoder-decoder powerhouse squeezes multimodal smarts and massive context into tiny packages. Imagine running 270M parameters running smoothly on your laptop. If you’re looking for an efficient AI that handles text, […]\nThe post Google T5Gemma-2 Explained: Trying Out a Laptop-Friendly Multimodal AI Model appeared first on Analytics Vidhya.",
      "published_date": "2026-01-01T12:35:11",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Student ID Benefits Worth Thousands: Get 15+ Premium Tools For Free or on Discount",
      "url": "https://www.analyticsvidhya.com/blog/2025/12/student-id-discounts-worth-thousands/",
      "content": "I remember from my student days the plethora of subscriptions, fees, and payments to be made for a range of tasks. Be it learning a new skill, using the right environment for practice, or simply travelling to and from home, we had to shell money out of our pockets. But it is almost 2026 now, […]\nThe post Student ID Benefits Worth Thousands: Get 15+ Premium Tools For Free or on Discount appeared first on Analytics Vidhya.",
      "published_date": "2025-12-31T10:52:25",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    }
  ]
}