{
  "timestamp": "2026-01-23T10:28:22.084582",
  "key": "source_analyticsvidhya_7days",
  "value": [
    {
      "title": "Top 7 Free Generative AI Courses with Certificates",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/free-generative-ai-courses-with-certificates/",
      "content": "Generative AI is in the vogue. It is powering all the latest technologies and is one of the most sought out skills in the job market, becoming a must-have skill in present date. But for those who aren’t familiar with GenAI, it might seem like a distant dream considering how hard it is to get […]\nThe post Top 7 Free Generative AI Courses with Certificates appeared first on Analytics Vidhya.",
      "published_date": "2026-01-22T13:21:26",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Vibe Coding a Bridge-Ball Game with Emergent in Minutes",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/vibe-coding-game-with-emergent-in-minutes/",
      "content": "In the past couple of years, we have seen vibe coding evolve from just an idea that sounded “fancy” to a full-time practice for many budding developers. What used to sound like a gimmick is now a must-have skill, even in the professional world. Proof? The recent round of funding secured by one such platform. […]\nThe post Vibe Coding a Bridge-Ball Game with Emergent in Minutes appeared first on Analytics Vidhya.",
      "published_date": "2026-01-22T11:11:06",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "50+ Machine Learning Resources for Self Study in 2026",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/machine-learning-resources-for-self-study/",
      "content": "Are you following the trend or genuinely interested in Machine Learning? Either way, you will need the right resources to TRUST, LEARN and SUCCEED. If you are unable to find the right Machine Learning resource in 2026? We are here to help. Let’s reiterate the definition of Machine Learning… Machine learning is an exciting field […]\nThe post 50+ Machine Learning Resources for Self Study in 2026 appeared first on Analytics Vidhya.",
      "published_date": "2026-01-21T19:23:00",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "10 NotebookLM Super Prompts For Pro-Level Productivity",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/notebooklm-super-prompts-for-pro-level-productivity/",
      "content": "I have reiterated it time and again. But let me mention it here once more – NotebookLM is one of the most powerful AI tools present today. If you already know of it, the reasons for this statement are obvious to you. In case you are unaware, know that NotebookLM can change the way you […]\nThe post 10 NotebookLM Super Prompts For Pro-Level Productivity appeared first on Analytics Vidhya.",
      "published_date": "2026-01-21T11:07:37",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "MCPToolbox for Databases: A Practical Guide to Bridging LLMs and Your Data",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/mcptoolbox-for-databases/",
      "content": "Talking to software feels natural now, until you need real business data. That’s where things usually break. MCPToolbox to Databases fixes this by giving AI agents safe, reliable access to production databases through a standardized MCP interface. Databases become first-class tools that agents can inspect, query, and reason over using clean, production-ready natural language to […]\nThe post MCPToolbox for Databases: A Practical Guide to Bridging LLMs and Your Data  appeared first on Analytics Vidhya.",
      "published_date": "2026-01-21T09:32:52",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Flux.2 Klein Debuts: Trying The Compact and Fast AI Image Model",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/flux-2-klein-ai-image-model/",
      "content": "I see AI image models getting better every month. Sharper outputs, more parameters, higher benchmark scores. So why would I, or anyone for that matter, get excited about a smaller AI image model? Well, because most image models still behave like offline tools. You prompt, you wait, you hope. There is nothing interactive about that. […]\nThe post Flux.2 Klein Debuts: Trying The Compact and Fast AI Image Model appeared first on Analytics Vidhya.",
      "published_date": "2026-01-21T06:03:03",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "DuckDB vs. SQLite: A Comprehensive Comparison",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/duckdb-vs-sqlite/",
      "content": "AI and ML developers often work with local datasets while preprocessing data. Engineering features, and building prototypes make this easy without the overhead of a full server. The most common comparison is between SQLite, a serverless database released in 2000 and widely used for lightweight transactions, and DuckDB, introduced in 2019 as the SQLite of […]\nThe post DuckDB vs. SQLite: A Comprehensive Comparison  appeared first on Analytics Vidhya.",
      "published_date": "2026-01-20T14:28:02",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "What are Recursive Language Models (RLM)?",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/what-are-recursive-language-models-rlm/",
      "content": "Large language models are great. We all can agree to that. They’ve been a cornerstone of modern industry and are increasingly impacting more and more domains.  With constant upgrades and improvements to the architecture and capabilities of language models, one might think – That’s it! Alas… A recent development under the name of RLM or […]\nThe post What are Recursive Language Models (RLM)? appeared first on Analytics Vidhya.",
      "published_date": "2026-01-20T07:53:21",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "How I Created an AI Comic Using Gemini 3 and NotebookLM",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/ai-comic-generation/",
      "content": "Gemini 3 and NotebookLM are two of my favorite tools from the Google suite. I use them often for learning, work, and even for breaking down complex ideas in a simple way. But this time, I wanted to do something purely fun. Lately, I’ve been seeing AI-generated comics all over social media. From story writing […]\nThe post How I Created an AI Comic Using Gemini 3 and NotebookLM appeared first on Analytics Vidhya.",
      "published_date": "2026-01-19T11:13:20",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "What is Context Window in LLM? Explained in 2 Minutes",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/context-window-in-llm/",
      "content": "We interact with LLMs every day. We write prompts, paste documents, continue long conversations, and expect the model to remember what we said earlier. When it does, we move on. When it doesn’t, we repeat ourselves or assume something went wrong. What most people rarely think about is that every response is constrained by something […]\nThe post What is Context Window in LLM? Explained in 2 Minutes appeared first on Analytics Vidhya.",
      "published_date": "2026-01-19T04:09:00",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    }
  ]
}