{
  "timestamp": "2026-01-29T09:40:54.895503",
  "key": "source_analyticsvidhya_7days",
  "value": [
    {
      "title": "DeepSeek OCR 2: AI That Reads Documents Like Humans",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/deepseek-ocr-2/",
      "content": "If you’ve worked with DeepSeek OCR, you already know it was efficient at extracting text and compressing documents. Where it often fell short was reading order and layout-heavy pages, multi-column PDFs, dense tables, and mixed content still needed cleanup. DeepSeek OCR 2 is DeepSeek’s answer to that gap. Instead of focusing only on compression, this update shifts attention […]\nThe post DeepSeek OCR 2: AI That Reads Documents Like Humans appeared first on Analytics Vidhya.",
      "published_date": "2026-01-28T22:35:32",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Top 10 Python Libraries for AI and Machine Learning",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/python-libraries-for-ai-and-machine-learning/",
      "content": "Python dominates AI and machine learning for one simple reason: its ecosystem is amazing. Most projects are built on a small set of libraries that handle everything from data loading to deep learning at scale. Knowing these libraries makes the entire development process fast and easy. Let’s break them down in a practical order. Starting […]\nThe post Top 10 Python Libraries for AI and Machine Learning appeared first on Analytics Vidhya.",
      "published_date": "2026-01-28T12:40:49",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "I Tested Clawdbot and Built My Own Local AI Agent",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/clawdbot-guide/",
      "content": "Most AI assistants still stop at conversation. They answer questions, forget everything afterward, and never actually do anything for you. Clawdbot changes that. Instead of living inside a chat window, Clawdbot runs on your own machine, stays online, remembers past interactions, and executes real tasks. It connects directly to messaging platforms like WhatsApp and Telegram, […]\nThe post I Tested Clawdbot and Built My Own Local AI Agent appeared first on Analytics Vidhya.",
      "published_date": "2026-01-27T21:27:18",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Is Kimi K2.5 the BEST Open-source Model of 2026?",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/kimi-k2-5/",
      "content": "My favourite open-source AI model just got a major upgrade..Kimi K2.5 is here! LLMs excel at answering questions and writing code, but real work spans messy documents, images, incomplete data, and long decision chains. Most AI systems still struggle in these environments. Moonshot AI built Kimi K2.5 to close this gap by bringing multimodal, agentic intelligence to […]\nThe post Is Kimi K2.5 the BEST Open-source Model of 2026? appeared first on Analytics Vidhya.",
      "published_date": "2026-01-27T20:05:08",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Guide to AI Benchmarks: MMLU, HumanEval, and More Explained",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/ai-benchmarks/",
      "content": "As the days go by, there are more benchmarks than ever. It is hard to keep track of every HellaSwag or DS-1000 that comes out. Also, what are they even for? Bunch of cool looking names slapped on top of a benchmark to make them look cooler… Not really. Other than the zany naming that […]\nThe post Guide to AI Benchmarks: MMLU, HumanEval, and More Explained appeared first on Analytics Vidhya.",
      "published_date": "2026-01-27T08:45:39",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "AgentScope AI: A Complete Guide to Building Scalable Multi-Agent Systems with LLMs",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/agentscope-ai/",
      "content": "Modern AI applications rely on intelligent agents that think, cooperate, and execute complex workflows, while single-agent systems struggle with scalability, coordination, and long-term context. AgentScope AI addresses this by offering a modular, extensible framework for building structured multi-agent systems, enabling role assignment, memory control, tool integration, and efficient communication without unnecessary complexity for developers and […]\nThe post AgentScope AI: A Complete Guide to Building Scalable Multi-Agent Systems with LLMs  appeared first on Analytics Vidhya.",
      "published_date": "2026-01-26T09:24:51",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Building Intelligent iOS Apps with Apple’s Foundation Models Framework",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/apple-foundation-models-framework/",
      "content": "The iOS development world has undergone a radical change. Only a few years back, implementing AI functionalities required costly cloud APIs or, at best, on-device processing with limited capabilities. The introduction of Apple’s Foundation Models framework heralds the availability of a 3 billion parameter language model for developers who prefer on-device processing, and it is […]\nThe post Building Intelligent iOS Apps with Apple’s Foundation Models Framework  appeared first on Analytics Vidhya.",
      "published_date": "2026-01-26T09:21:10",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Model Quantization Guide: Reduce Model Size 4x with PyTorch",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/model-quantization/",
      "content": "I just downloaded the latest 4 Billion parameter model. I hit ‘Run‘. After a while, the Google Colab instance crashes. Sounds familiar? Well this is bound to happen if we don’t pay attention to the required VRAM and what VRAM we are providing to the model. Quantization is something that can help you tackle this […]\nThe post Model Quantization Guide: Reduce Model Size 4x with PyTorch appeared first on Analytics Vidhya.",
      "published_date": "2026-01-26T09:07:22",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "How UX Research Methods Reveal Hidden AI Orchestration Failures in Enterprise Collaboration Agents",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/how-ux-research-reveals-hidden-ai-orchestration-failures/",
      "content": "I have spent the last several years watching enterprise collaboration tools get smarter. Join a video call today, and there’s a good chance five or six AI agents are running simultaneously: transcription, speaker identification, captions, summarization, task extraction. On the product side of it, each agent gets evaluated in isolation. Separate dashboards, separate metrics. Transcription […]\nThe post How UX Research Methods Reveal Hidden AI Orchestration Failures in Enterprise Collaboration Agents appeared first on Analytics Vidhya.",
      "published_date": "2026-01-25T09:13:32",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Deep Learning vs. Machine Learning: Key Differences Explained for Business Leaders",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/machine-learning-vs-deep-learning/",
      "content": "Machine learning is about learning from experience. Algorithms study data, spot patterns, and get better over time. When trained on things like purchase history, these models can anticipate what people might want next. It’s practical, adaptive, and already part of how many everyday decisions are made. Artificial intelligence is no longer a distant idea. It’s […]\nThe post Deep Learning vs. Machine Learning: Key Differences Explained for Business Leaders  appeared first on Analytics Vidhya.",
      "published_date": "2026-01-24T09:51:30",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    }
  ]
}