{
  "timestamp": "2026-02-02T09:46:09.076278",
  "key": "source_analyticsvidhya_7days",
  "value": [
    {
      "title": "Gradient Boosting vs AdaBoost vs XGBoost vs CatBoost vs LightGBM: Finding the Best Gradient Boosting Method",
      "url": "https://www.analyticsvidhya.com/blog/2026/02/gradient-boosting-vs-adaboost-vs-xgboost-vs-catboost-vs-lightgbm/",
      "content": "One of the best-performing algorithms in machine learning is the boosting algorithm. These are characterised by good predictive abilities and accuracy. All the methods of gradient boosting are based on a universal notion. They get to learn through the errors of the former models. Each new model is aimed at correcting the previous mistakes. This […]\nThe post Gradient Boosting vs AdaBoost vs XGBoost vs CatBoost vs LightGBM: Finding the Best Gradient Boosting Method appeared first on Analytics Vidhya.",
      "published_date": "2026-02-01T00:13:35",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Moltbook: Where Your AI Agent Goes to Socialize",
      "url": "https://www.analyticsvidhya.com/blog/2026/02/moltbook-for-openclaw-agents/",
      "content": "In late 2025, an open-source project called Clawdbot was released. Built by Peter Steinberger, it was designed to be a practical personal AI assistant: not a chatbot, but a system that could actually do things. As it evolved, Clawdbot was renamed twice. First to Moltbot, and then to OpenClaw. You can run it on your own machine, connect it to email, files, APIs, and […]\nThe post Moltbook: Where Your AI Agent Goes to Socialize appeared first on Analytics Vidhya.",
      "published_date": "2026-01-31T22:49:21",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "End-to-End Machine Learning Project on Amazon Sales Data Using Python",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/machine-learning-project-on-amazon-sales-data-using-python/",
      "content": "Machine learning projects work best when they connect theory to real business outcomes. In e-commerce, that means better revenue, smoother operations, and happier customers, all driven by data. By working with realistic datasets, practitioners learn how models turn patterns into decisions that actually matter. This article walks through a full machine learning workflow using an […]\nThe post End-to-End Machine Learning Project on Amazon Sales Data Using Python  appeared first on Analytics Vidhya.",
      "published_date": "2026-01-31T17:48:56",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "5 Gemini Prompts for JEE Preparation",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/jee-preparation-with-gemini-top-prompts/",
      "content": "Hot take – just like the Internet era, Google is leading the AI revolution. While there are many AI solutions out there, almost none of them integrate with the daily lives of users as deeply as Google’s AI ecosystem. Case in point: the tech giant has now partnered with PhysicsWallah and Career360 and come up […]\nThe post 5 Gemini Prompts for JEE Preparation appeared first on Analytics Vidhya.",
      "published_date": "2026-01-30T11:58:49",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "20 LLM Questions You’ll See Everywhere in 2026",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/llm-interview-questions-and-answers/",
      "content": "LLMs aren’t limited to AI and related fields! They’re powering almost every tech, and thereby is one of the most asked about topics in interviews. This makes it essential to have a surface level familiarity of the technology. This article is designed to mirror how LLMs show up in real interviews. We’ll start from first […]\nThe post 20 LLM Questions You’ll See Everywhere in 2026 appeared first on Analytics Vidhya.",
      "published_date": "2026-01-30T11:53:09",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "5 Biggest Hackathons of 2026 That You Can’t Miss",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/top-hackathons-to-participate-in/",
      "content": "Another year, another opportunity. For the nerdy ones, this is the right time to participate in some of the best hackathons that are out there. With hosts like Google DeepMind, Kaggle and Fractal having hackathons simultaneously, there is plenty of challenge on offer in 2026. Here you’ll find 5 of the most trending hackathons that […]\nThe post 5 Biggest Hackathons of 2026 That You Can’t Miss appeared first on Analytics Vidhya.",
      "published_date": "2026-01-30T09:32:19",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Make PPTs, PDFs, and Excel Sheets in Seconds With Kimi K2.5",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/make-ppts-pdfs-and-excel-sheets-in-seconds-with-kimi-k2-5/",
      "content": "Just earlier this month, Moonshot AI dropped a bomb in the AI world with the Kimi K2.5. With a 1 trillion-parameter MoE model with 32 billion active parameters, Kimi K2.5 roared onto the scene, shaking the likes of GPT 5 and Gemini 3 Pro. At the time, we had covered how it is one of […]\nThe post Make PPTs, PDFs, and Excel Sheets in Seconds With Kimi K2.5 appeared first on Analytics Vidhya.",
      "published_date": "2026-01-29T13:13:52",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "16 NotebookLM Prompts Every Teacher Should Be Using in 2026",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/notebooklm-for-teachers/",
      "content": "Late last year, Google came up with a comprehensive plan to fix the current educational system for the better. How? Majorly with the help of Artificial Intelligence, or AI, in education. We had covered the plan in a detailed report at the time, which you can read here. Ever since, the tech giant’s AI solutions […]\nThe post 16 NotebookLM Prompts Every Teacher Should Be Using in 2026 appeared first on Analytics Vidhya.",
      "published_date": "2026-01-29T09:04:22",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "DeepSeek OCR 2: AI That Reads Documents Like Humans",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/deepseek-ocr-2/",
      "content": "If you’ve worked with DeepSeek OCR, you already know it was efficient at extracting text and compressing documents. Where it often fell short was reading order and layout-heavy pages, multi-column PDFs, dense tables, and mixed content still needed cleanup. DeepSeek OCR 2 is DeepSeek’s answer to that gap. Instead of focusing only on compression, this update shifts attention […]\nThe post DeepSeek OCR 2: AI That Reads Documents Like Humans appeared first on Analytics Vidhya.",
      "published_date": "2026-01-28T22:35:32",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Top 10 Python Libraries for AI and Machine Learning",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/python-libraries-for-ai-and-machine-learning/",
      "content": "Python dominates AI and machine learning for one simple reason: its ecosystem is amazing. Most projects are built on a small set of libraries that handle everything from data loading to deep learning at scale. Knowing these libraries makes the entire development process fast and easy. Let’s break them down in a practical order. Starting […]\nThe post Top 10 Python Libraries for AI and Machine Learning appeared first on Analytics Vidhya.",
      "published_date": "2026-01-28T12:40:49",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    }
  ]
}