{
  "timestamp": "2026-01-13T13:41:45.492960",
  "key": "source_analyticsvidhya_7days",
  "value": [
    {
      "title": "How to Integrate Universal Commerce Protocol (UCP) with AI Agents?",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/universal-commerce-protocol-by-google/",
      "content": "Agentic browsing is quickly becoming mainstream. People don’t just want AI agents to research products anymore. They want agents to actually buy things for them: compare options, place orders, handle payments, and complete the entire transaction. That’s where things started to break. Today’s commerce stack is fragmented. Every merchant, platform, and payment provider uses proprietary integrations. So even […]\nThe post How to Integrate Universal Commerce Protocol (UCP) with AI Agents? appeared first on Analytics Vidhya.",
      "published_date": "2026-01-12T18:08:43",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "What is Model Collapse? Examples, Causes and Fixes",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/model-collapse/",
      "content": "AI systems feel smarter than ever. They answer quickly, confidently, and with polish. But beneath that surface, something subtle is going wrong. Outputs are getting safer. Ideas are getting narrower. Surprise is disappearing – less aweful.  This matters because AI is increasingly involved in how we search, decide, create, and evaluate. When these systems lose […]\nThe post What is Model Collapse? Examples, Causes and Fixes appeared first on Analytics Vidhya.",
      "published_date": "2026-01-12T11:52:23",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "10 Hackathons You Can Join in 2026",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/top-hackathon-platforms/",
      "content": "Hackathons are different!. The good ones pull you in, stretch your thinking, and leave you with something real—regardless of the outcome. The problem is choice. It’s hard to find the right one! Too many hackathons. Too many formats. And too much noise. So this list is built with that in mind. Instead out outlining Hackathons […]\nThe post 10 Hackathons You Can Join in 2026 appeared first on Analytics Vidhya.",
      "published_date": "2026-01-11T06:36:08",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "CES 2026: 17 AI Reveals That Will Blow Your Mind",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/ces-2026-top-ai-reveals/",
      "content": "AI is taking over the world. If you don’t agree to this, you need to have a look at the latest technologies presented at one of the biggest annual technology events – the CES 2026. Consumer Electronics Show, which takes place in Las Vegas, US, every year, brings forward the best of technologies being pursued […]\nThe post CES 2026: 17 AI Reveals That Will Blow Your Mind appeared first on Analytics Vidhya.",
      "published_date": "2026-01-10T08:53:53",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Agentic AI Learning Path 2026",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/agentic-ai-expert-learning-path/",
      "content": "If you’re curious about trending terms like AI Agents or Agentic AI, you’re in the right place. Agentic AI is rapidly moving from experimentation to enterprise adoption. According to Gartner, over 60% of enterprise AI applications are expected to include agentic components by 2026, while more than 40% of early agentic AI projects are projected to be abandoned due to poor architecture, cost overruns, and lack of […]\nThe post Agentic AI Learning Path 2026 appeared first on Analytics Vidhya.",
      "published_date": "2026-01-10T08:39:22",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "NyRAG: Building Production-Ready RAG Applications with Zero Code",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/nyrag-building-rag-applications-with-zero-code/",
      "content": "Retrieval-Augmented Generation (RAG) technology almost immediately became the standard in intelligent applications. This was a result of the quickly developing field of artificial intelligence that combined large language models and external knowledge bases with different real-time access methods. RAG implementation of the traditional kind poses major difficulties: complex vector database setups, intricate embedding pathways, orchestration […]\nThe post NyRAG: Building Production-Ready RAG Applications with Zero Code appeared first on Analytics Vidhya.",
      "published_date": "2026-01-09T13:31:28",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "8 FREE Google AI Tools to Enhance your Workflow",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/free-google-ai-tools/",
      "content": "The name Google has always been synonymous with technology, and things are no different in the age of AI. Google has quietly been the frontrunner in the AI revolution with a host of products that surprisingly few people know about. Of course, the showstoppers like Gemini and NotebookLM have been popular, but their capabilities have […]\nThe post 8 FREE Google AI Tools to Enhance your Workflow appeared first on Analytics Vidhya.",
      "published_date": "2026-01-08T17:01:14",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "10 RAG Projects That Actually Teach You Retrieval",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/rag-projects/",
      "content": "Most RAG demos stop at “upload a PDF and ask a question.” That proves the pipeline works. It doesn’t prove you understand it. These projects are designed to break in interesting ways. They surface bias, contradictions, forgotten context, and overconfident answers. That’s where real RAG learning starts. Once you’re through these, you would have an […]\nThe post 10 RAG Projects That Actually Teach You Retrieval appeared first on Analytics Vidhya.",
      "published_date": "2026-01-08T16:52:25",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "Win 2026! 9 AI Prompts to Enter Beast Mode This New Year",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/win-2026-9-ai-prompts-to-enter-beast-mode-this-new-year/",
      "content": "The beginning of a new year brings about a new sense of energy in most. One may argue that it is all psychological, as nothing changes other than the date. Agreed, to a point. Though it is psychological, the change is not just based on the onset of a “new year.” A deep-rooted logical reasoning […]\nThe post Win 2026! 9 AI Prompts to Enter Beast Mode This New Year appeared first on Analytics Vidhya.",
      "published_date": "2026-01-07T12:42:05",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    },
    {
      "title": "10 Python Projects for Beginners",
      "url": "https://www.analyticsvidhya.com/blog/2026/01/beginner-python-projects/",
      "content": "Learning Python at the beginning feels deceptively simple. You write a few lines, the code runs, and it’s tempting to think you’ve got it. Then you try to build something on your own and… nothing works!? Turns out all the information you had learnt, didn’t find an outlet.  That’s where challenging projects matter. Not flashy […]\nThe post 10 Python Projects for Beginners appeared first on Analytics Vidhya.",
      "published_date": "2026-01-07T05:56:16",
      "source": "Analytics Vidhya",
      "source_id": "analyticsvidhya",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 8,
      "focus_tags": [
        "数据科学",
        "机器学习",
        "实战教程"
      ]
    }
  ]
}