{
  "timestamp": "2026-01-23T10:28:23.223064",
  "key": "source_adexchanger_7days",
  "value": [
    {
      "title": "You’re Not Imagining It – There Are More Shoppable CTV Ads On YouTube Now",
      "url": "https://www.adexchanger.com/tv/youre-not-imagining-it-there-are-more-shoppable-ctv-ads-on-youtube-now/",
      "content": "YouTube has spent the past seven months iterating and then quietly rolling them out to buyers via Google’s Merchant Center (GMC) platform. Starting Thursday, those formats will officially roll out to all of Google’s Performance Max and Demand Gen campaigns.\nThe post You’re Not Imagining It – There Are More Shoppable CTV Ads On YouTube Now appeared first on AdExchanger.",
      "published_date": "2026-01-22T17:00:22",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "What We Know: ChatGPT Is Launching Ads. The Rest Is Speculation",
      "url": "https://www.adexchanger.com/ai/what-we-know-chatgpt-is-launching-ads-the-rest-is-speculation/",
      "content": "ChatGPT's initial ad rollout didn't come as a surprise. Now, advertisers are figuring out how to make the most of this new channel.\nThe post What We Know: ChatGPT Is Launching Ads. The Rest Is Speculation appeared first on AdExchanger.",
      "published_date": "2026-01-22T14:05:48",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Privacy Enforcement Crossed A Line In 2025 – And There’s No Going Back",
      "url": "https://www.adexchanger.com/data-driven-thinking/privacy-enforcement-crossed-a-line-in-2025-and-theres-no-going-back/",
      "content": "For most of the last decade, privacy compliance lived in a gray zone. Companies could point to a cookie banner, update a policy and reasonably believe they were doing enough.  In 2025, that gray zone disappeared. What changed was not the sudden arrival of a sweeping new law, but the scale and seriousness of enforcement. […]\nThe post Privacy Enforcement Crossed A Line In 2025 – And There’s No Going Back appeared first on AdExchanger.",
      "published_date": "2026-01-22T05:35:34",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "AI Ad Revenue Drama Sweeps Davos; A Higher Threads Count",
      "url": "https://www.adexchanger.com/daily-news-roundup/thursday-22012026/",
      "content": "Everyone has an opinion on OpenAI's revenue prospects; Threads rolls out ads universally; and sports are a bastion of strength for Paramount.\nThe post AI Ad Revenue Drama Sweeps Davos; A Higher Threads Count appeared first on AdExchanger.",
      "published_date": "2026-01-22T05:03:04",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Hershey’s Undergoes A Brand Update As It Rethinks Paid, Earned And Owned Media",
      "url": "https://www.adexchanger.com/commerce/hersheys-undergoes-a-brand-update-as-it-rethinks-paid-earned-and-owned-media/",
      "content": "The Hershey Company requires practically no advertising. The brand sits right at the warm, gooey center of everyone’s subconscious. That’s how Hershey’s bars can sell on American store shelves for 125 years, in the same boring candy bar wrapper – dull gray letters on a field of brown – without much emphasis on paid media […]\nThe post Hershey’s Undergoes A Brand Update As It Rethinks Paid, Earned And Owned Media appeared first on AdExchanger.",
      "published_date": "2026-01-21T18:40:28",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Sizing Up Success Metrics, With The CMO Of True Religion",
      "url": "https://www.adexchanger.com/adexchanger-talks/sizing-up-success-metrics-with-the-cmo-of-true-religion/",
      "content": "Measurement, like buying jeans, is about finding the right fit. For denim brand True Religion, that means looking beyond last-click attribution to see what’s really driving growth, says CMO Kristen D’Arcy on this week’s episode of AdExchanger Talks. Determining incrementality is important for any marketer, but accountability for business results is front and center for […]\nThe post Sizing Up Success Metrics, With The CMO Of True Religion appeared first on AdExchanger.",
      "published_date": "2026-01-21T14:43:03",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "A Win For Open Standards: Amazon’s Prebid Adapter Goes Live",
      "url": "https://www.adexchanger.com/publishers/a-win-for-open-standards-amazons-prebid-adapter-goes-live/",
      "content": "When Amazon Publisher Services (APS) announced plans to release a Prebid adapter last year, it marked a notable victory for open standards over controlled, proprietary integrations. Now, Amazon’s promise to support a more collaborative programmatic ecosystem has gotten a little closer to reality: The APS Prebid adapter is available for open beta testing, APS announced […]\nThe post A Win For Open Standards: Amazon’s Prebid Adapter Goes Live appeared first on AdExchanger.",
      "published_date": "2026-01-21T14:00:29",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "How Betterment Used A Custom Bidding Script To Refine Its Ad Strategy",
      "url": "https://www.adexchanger.com/platforms/how-betterment-used-a-custom-bidding-script-to-refine-its-ad-strategy/",
      "content": "Adswerve recently developed a custom bidding script to help Betterment generate more conversions from its leads.\nThe post How Betterment Used A Custom Bidding Script To Refine Its Ad Strategy appeared first on AdExchanger.",
      "published_date": "2026-01-21T05:03:59",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Can Amazon Be Luxurious?; The Declaration Of Dependence",
      "url": "https://www.adexchanger.com/daily-news-roundup/wednesday-21012026/",
      "content": "A Life Of Luxury The internet is a powerhouse for commerce – just not so much when it comes to the luxury category.  Although that’s hardly surprising. Over the past several years, fast-fashion and discount-driven marketplaces like Temu, Shein and Amazon have put relentless downward pressure on the cost of luxury items. Now, major retailers are […]\nThe post Can Amazon Be Luxurious?; The Declaration Of Dependence appeared first on AdExchanger.",
      "published_date": "2026-01-21T05:03:14",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Netflix Doubled Its Ad Revenue Last Year – And Expects To Do The Same In 2026",
      "url": "https://www.adexchanger.com/streaming/netflix-doubled-its-ad-revenue-last-year-and-expects-to-do-the-same-in-2026/",
      "content": "Netflix dropped two sets of numbers on the same day: its 2025 full-year earnings and a revised offer for Warner Bros. Discovery. During a call with investors, Netflix boasted that it beat its revenue expectations for last year, ending 2025 with $42.5 billion in revenue, a 16% year-over-year jump.\nThe post Netflix Doubled Its Ad Revenue Last Year – And Expects To Do The Same In 2026 appeared first on AdExchanger.",
      "published_date": "2026-01-21T00:35:34",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    }
  ]
}