{
  "timestamp": "2026-01-13T13:41:51.247244",
  "key": "source_adexchanger_7days",
  "value": [
    {
      "title": "What’s The Protocol?; It Might Be Time For X To See Itself Out",
      "url": "https://www.adexchanger.com/daily-news-roundup/tuesday-13012026/",
      "content": "Retail media gets its own special kind of AI agents; xAI has a CSAM problem; and Discord might be trying to go public. \nThe post What’s The Protocol?; It Might Be Time For X To See Itself Out appeared first on AdExchanger.",
      "published_date": "2026-01-13T05:01:06",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Why Political Advertisers Can’t Afford Unverified Reach In 2026",
      "url": "https://www.adexchanger.com/content-studio/why-political-advertisers-cant-afford-unverified-reach-in-2026/",
      "content": "Political advertising has always evolved alongside media consumption. But the shift from linear television to streaming has introduced challenges that campaign managers are still working to navigate. While connected TV (CTV) promises precision and flexibility, the reality facing political advertisers today is far more complex and less standardized. As dollars move from traditional TV to […]\nThe post Why Political Advertisers Can’t Afford Unverified Reach In 2026 appeared first on AdExchanger.",
      "published_date": "2026-01-12T13:00:06",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "The Big Story: Live From CES 2026",
      "url": "https://www.adexchanger.com/the-big-story/the-big-story-live-from-ces-2026/",
      "content": "Agents, streamers and robots, oh my! Live from the C-Space campus at the Aria Casino in Las Vegas, our team breaks down the most interesting ad tech trends we saw at CES this year.\nThe post The Big Story: Live From CES 2026 appeared first on AdExchanger.",
      "published_date": "2026-01-12T12:01:13",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Ad Tech Doesn’t Just Have A Transparency Problem. It Has A Courage Problem",
      "url": "https://www.adexchanger.com/data-driven-thinking/ad-tech-doesnt-just-have-a-transparency-problem-it-has-a-courage-problem/",
      "content": "What type of leadership and attitude do we need to innovate in digital advertising and ad tech?  We work in a highly polarized industry where our methods of tackling fraud and providing transparency are shaped by conflicting and self-interested business models. And the industry leaders who loudly and publicly advocate for their interests seem to […]\nThe post Ad Tech Doesn’t Just Have A Transparency Problem. It Has A Courage Problem appeared first on AdExchanger.",
      "published_date": "2026-01-12T05:35:27",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Who Would Grab The Live Wire?; AI, AI Everywhere",
      "url": "https://www.adexchanger.com/daily-news-roundup/monday-12012026/",
      "content": "Off Ramp Publicis signed a deal to license LiveRamp’s RampID and Authenticated Traffic Solutions (its alternative IDs to third-party cookies) on behalf of clients. This alone is hardly major news. After all, LiveRamp sells its cookieless identity products to all the major holdcos.  But Ad Age also reports that Publicis execs were “exploring” the idea […]\nThe post Who Would Grab The Live Wire?; AI, AI Everywhere appeared first on AdExchanger.",
      "published_date": "2026-01-12T05:03:54",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Amazon Ads Shares Interactive Video Best Practices At CES 2026",
      "url": "https://www.adexchanger.com/tv/amazon-ads-shares-interactive-video-best-practices-at-ces-2026/",
      "content": "Interactive video ads make more of an impact than you might expect, according to new research by Amazon Ads and Publicis Media. But when it comes to interactivity, “Simplicity is key,” said Maggie Zhang, head of global video measurement GTM at Amazon Ads, during a chat with AdExchanger at CES 2026. Viewers overwhelmingly prefer straightforward […]\nThe post Amazon Ads Shares Interactive Video Best Practices At CES 2026 appeared first on AdExchanger.",
      "published_date": "2026-01-09T21:55:29",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Interactive CTV Ads Were Mostly Talk – Until Now",
      "url": "https://www.adexchanger.com/tv/interactive-ctv-ads-were-mostly-talk-until-now/",
      "content": "For years, interactive CTV advertising was the star of industry demos – promising, flashy and mostly theoretical. In 2025, they finally made the leap from proof of concept to practice.\nThe post Interactive CTV Ads Were Mostly Talk – Until Now appeared first on AdExchanger.",
      "published_date": "2026-01-09T12:16:22",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Comic: Quarterly Revenue Planning",
      "url": "https://www.adexchanger.com/comic-strip/comic-quarterly-revenue-planning/",
      "content": "Enjoy this weekly comic strip from AdExchanger.com that highlights the digital advertising ecosystem … \nThe post Comic: Quarterly Revenue Planning appeared first on AdExchanger.",
      "published_date": "2026-01-09T05:15:43",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "Amazon Strives For Streaming Ad Dominance; Everything But The Media",
      "url": "https://www.adexchanger.com/daily-news-roundup/friday-09012026/",
      "content": "Amazon touts its Marketing Cloud, but buyers have concerns; OpenAI's ad biz may face challenges; and in-chat shopping isn't all it's cracked up to be.\nThe post Amazon Strives For Streaming Ad Dominance; Everything But The Media appeared first on AdExchanger.",
      "published_date": "2026-01-09T05:03:32",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    },
    {
      "title": "2025: The Year Google Lost In Court And Won Anyway",
      "url": "https://www.adexchanger.com/antitrust/2025-the-year-google-lost-in-court-and-won-anyway/",
      "content": "From afar, it looks like Google had a rough year. It was found guilty of operating an illegal search monopoly and a publisher ad tech monopoly, not to mention getting hit with a raft of civil antitrust suits brought by ad tech But zoom in a bit and it becomes clear that the past year […]\nThe post 2025: The Year Google Lost In Court And Won Anyway appeared first on AdExchanger.",
      "published_date": "2026-01-08T11:56:36",
      "source": "AdExchanger",
      "source_id": "adexchanger",
      "language": "en",
      "credibility_score": 8,
      "relevance_weight": 9,
      "focus_tags": [
        "程序化广告",
        "数据驱动营销",
        "广告技术"
      ]
    }
  ]
}