{
  "timestamp": "2026-01-06T11:29:02.135113",
  "key": "source_techmeme_7days",
  "value": [
    {
      "title": "Xreal partners with Asus to unveil ROG Xreal R1 gaming glasses with 1080p micro-OLED displays and a 240Hz refresh rate, launching in H1 2026 (Cameron Faulkner/The Verge)",
      "url": "http://www.techmeme.com/260105/p37#a260105p37",
      "content": "Cameron Faulkner / The Verge:\nXreal partners with Asus to unveil ROG Xreal R1 gaming glasses with 1080p micro-OLED displays and a 240Hz refresh rate, launching in H1 2026  —  Doubling the standard refresh rate won't come cheap, and we don't know yet how much Xreal is going to charge. … Xreal is having a big CES.",
      "published_date": "2026-01-06T02:40:00",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "Nvidia says it's seeing \"strong\" demand from China for its H200 chips but is awaiting approvals from both Washington and Beijing before sales could begin (Nikkei Asia)",
      "url": "http://www.techmeme.com/260105/p36#a260105p36",
      "content": "Nikkei Asia:\nNvidia says it's seeing “strong” demand from China for its H200 chips but is awaiting approvals from both Washington and Beijing before sales could begin  —  LAS VEGAS — Nvidia says it has seen strong demand from China for its H200 chips, but the company is still waiting …",
      "published_date": "2026-01-06T02:20:01",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "Apple's macOS Tahoe adds icons to every menu item, resulting in menus that are hard to use and go against the long-standing Macintosh Human Interface Guidelines (Niki Tonsky/tonsky.me)",
      "url": "http://www.techmeme.com/260105/p35#a260105p35",
      "content": "Niki Tonsky / tonsky.me:\nApple's macOS Tahoe adds icons to every menu item, resulting in menus that are hard to use and go against the long-standing Macintosh Human Interface Guidelines  —  accompanied by explanation:  —  Fast forward to 2025.  Apple releases macOS Tahoe.  Main attraction?",
      "published_date": "2026-01-06T02:05:01",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "A look at Nvidia's Level 2 driving system, set to roll out to more carmakers in 2026, after a ~40-minute drive around San Francisco in a Mercedes-Benz CLA sedan (Andrew J. Hawkins/The Verge)",
      "url": "http://www.techmeme.com/260105/p34#a260105p34",
      "content": "Andrew J. Hawkins / The Verge:\nA look at Nvidia's Level 2 driving system, set to roll out to more carmakers in 2026, after a ~40-minute drive around San Francisco in a Mercedes-Benz CLA sedan  —  It's a beautiful, cloudless day in San Francisco, and I'm sitting in the passenger seat of a Mercedes-Benz CLA sedan.",
      "published_date": "2026-01-06T01:40:00",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "X faces fresh probes in Europe, India, and Malaysia after Grok generated explicit images of women and children; the UK says it has requested related info from X (Lora Kolodny/CNBC)",
      "url": "http://www.techmeme.com/260105/p33#a260105p33",
      "content": "Lora Kolodny / CNBC:\nX faces fresh probes in Europe, India, and Malaysia after Grok generated explicit images of women and children; the UK says it has requested related info from X  —  Elon Musk's X is being investigated by authorities in Europe, India and Malaysia after its Grok chatbot let users create …",
      "published_date": "2026-01-06T01:30:02",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "Nvidia announces the Alpamayo family of AI models, tools, and datasets for AVs, and details a collaboration with Mercedes-Benz on its first full-stack AV effort (Larry Dignan/Constellation Research)",
      "url": "http://www.techmeme.com/260105/p32#a260105p32",
      "content": "Larry Dignan / Constellation Research:\nNvidia announces the Alpamayo family of AI models, tools, and datasets for AVs, and details a collaboration with Mercedes-Benz on its first full-stack AV effort  —  Nvidia outlined its Alpamayo open AI models and datasets to bring reasoning to autonomous vehicles.",
      "published_date": "2026-01-06T00:45:01",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "Boston Dynamics partners with Google DeepMind to integrate Gemini Robotics models into Atlas robots, boosting their object-manipulation capabilities and more (Will Knight/Wired)",
      "url": "http://www.techmeme.com/260105/p31#a260105p31",
      "content": "Will Knight / Wired:\nBoston Dynamics partners with Google DeepMind to integrate Gemini Robotics models into Atlas robots, boosting their object-manipulation capabilities and more  —  Google DeepMind and Boston Dynamics are teaming up to integrate Gemini into a humanoid robot called Atlas.",
      "published_date": "2026-01-06T00:00:41",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "Intel details its 2nm 18A-process Panther Lake chips, showing major performance gains; laptops with Panther Lake Core Ultra Series 3 chips will debut on Jan. 27 (Michael Justin Allen Sexton/PCMag)",
      "url": "http://www.techmeme.com/260105/p30#a260105p30",
      "content": "Michael Justin Allen Sexton / PCMag:\nIntel details its 2nm 18A-process Panther Lake chips, showing major performance gains; laptops with Panther Lake Core Ultra Series 3 chips will debut on Jan. 27  —  Intel's 2-nanometer “18A” chip foundry has fired up at last, churning out the newest Core Ultra Series 3 processors for laptops and mini PCs, also known as “Panther Lake.”",
      "published_date": "2026-01-05T23:50:00",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "Dell brings back XPS branding with the new XPS 14 and 16 laptops, which address some complaints about the previous XPS design but lack dedicated GPU support (Rich Woods/XDA Developers)",
      "url": "http://www.techmeme.com/260105/p29#a260105p29",
      "content": "Rich Woods / XDA Developers:\nDell brings back XPS branding with the new XPS 14 and 16 laptops, which address some complaints about the previous XPS design but lack dedicated GPU support  —  It feels like only a year ago that Dell killed all branding on its laptops, telling journalists we were wrong when we almost universally told them they were crazy.",
      "published_date": "2026-01-05T23:30:01",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "Nvidia launches the Vera Rubin platform, saying it will offer dramatic reductions in inference and training costs compared to Blackwell, across six new chips (Stevie Bonifield/The Verge)",
      "url": "http://www.techmeme.com/260105/p28#a260105p28",
      "content": "Stevie Bonifield / The Verge:\nNvidia launches the Vera Rubin platform, saying it will offer dramatic reductions in inference and training costs compared to Blackwell, across six new chips  —  ﻿The Rubin GPU boasts five times more AI training compute power than Blackwell. … Nvidia is kicking off 2026 …",
      "published_date": "2026-01-05T23:15:00",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "Boston Dynamics unveils a new iteration of its Atlas humanoid robot designed to work in Hyundai's plants starting in 2028, including at a factory in Georgia (Hyonhee Shin/Bloomberg)",
      "url": "http://www.techmeme.com/260105/p27#a260105p27",
      "content": "Hyonhee Shin / Bloomberg:\nBoston Dynamics unveils a new iteration of its Atlas humanoid robot designed to work in Hyundai's plants starting in 2028, including at a factory in Georgia  —  Hyundai Motor Co.'s Boston Dynamics unit unveiled the latest iteration of a humanoid robot designed to work in the carmaker's …",
      "published_date": "2026-01-05T22:25:01",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "A live blog of Nvidia's keynote with CEO Jensen Huang at CES 2026, where the company is showcasing AI, robotics, simulation, gaming, and more (Katie Teague/Engadget)",
      "url": "http://www.techmeme.com/260105/p26#a260105p26",
      "content": "Katie Teague / Engadget:\nA live blog of Nvidia's keynote with CEO Jensen Huang at CES 2026, where the company is showcasing AI, robotics, simulation, gaming, and more  —  NVIDIA is showcasing robotics, simulation, gaming and more at CES 2026.  —  Last year during CES 2025, NVIDIA spent most of the time during …",
      "published_date": "2026-01-05T21:00:13",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "Lego unveils the Smart Play platform, with a brick powered by a custom chip that connects to compatible minifigures and tags for interactive lights and sounds (Jeremy White/Wired)",
      "url": "http://www.techmeme.com/260105/p25#a260105p25",
      "content": "Jeremy White / Wired:\nLego unveils the Smart Play platform, with a brick powered by a custom chip that connects to compatible minifigures and tags for interactive lights and sounds  —  The new sensor-packed Smart Play Brick will land this spring as part of a special Star Wars collection.",
      "published_date": "2026-01-05T20:25:04",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "A viral Reddit post by a purported developer alleging that a \"major food delivery app\" exploits drivers appears AI-generated; Uber and DoorDash deny the claims (Elissa Welle/The Verge)",
      "url": "http://www.techmeme.com/260105/p24#a260105p24",
      "content": "Elissa Welle / The Verge:\nA viral Reddit post by a purported developer alleging that a “major food delivery app” exploits drivers appears AI-generated; Uber and DoorDash deny the claims  —  It might be AI-generated, but food delivery apps do have a track record of exploiting workers.",
      "published_date": "2026-01-05T19:25:00",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    },
    {
      "title": "Sources: Nvidia has struggled to monetize its Omniverse software and the company shuttered its Omniverse Cloud service in August 2025 due to a lack of demand (The Information)",
      "url": "http://www.techmeme.com/260105/p23#a260105p23",
      "content": "The Information:\nSources: Nvidia has struggled to monetize its Omniverse software and the company shuttered its Omniverse Cloud service in August 2025 due to a lack of demand  —  In the past two years, Nvidia's business of selling chips for AI has rocketed into the stratosphere, lifting the company's revenue …",
      "published_date": "2026-01-05T19:00:28",
      "source": "Techmeme",
      "source_id": "techmeme",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 8,
      "focus_tags": [
        "实时聚合",
        "趋势追踪",
        "新闻热点",
        "技术讨论"
      ]
    }
  ]
}