{
  "timestamp": "2026-01-23T10:28:24.096057",
  "key": "source_arxiv_ai_7days",
  "value": [
    {
      "title": "The Ontological Neutrality Theorem: Why Neutral Ontological Substrates Must Be Pre-Causal and Pre-Normative",
      "url": "https://arxiv.org/abs/2601.14271",
      "content": "arXiv:2601.14271v1 Announce Type: new \nAbstract: Modern data systems must support accountability across persistent legal, political, and analytic disagreement. This requirement imposes strict constraints on the design of any ontology intended to function as a shared substrate. We establish an impossibility result for ontological neutrality: neutrality, understood as interpretive non-commitment and stability under incompatible extensions, is incompatible with the inclusion of causal or normative commitments at the foundational layer. Any ontology that asserts causal or deontic conclusions as ontological facts cannot serve as a neutral substrate across divergent frameworks without revision or contradiction. It follows that neutral ontological substrates must be pre-causal and pre-normative, representing entities, together with identity and persistence conditions, while externalizing interpretation, evaluation, and explanation. This paper does not propose a specific ontology or protocol; rather, it establishes the necessary design constraints for any system intended to maintain a shared, stable representation of reality across conflicting interpretive frameworks.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Epistemic Constitutionalism Or: how to avoid coherence bias",
      "url": "https://arxiv.org/abs/2601.14295",
      "content": "arXiv:2601.14295v1 Announce Type: new \nAbstract: Large language models increasingly function as artificial reasoners: they evaluate arguments, assign credibility, and express confidence. Yet their belief-forming behavior is governed by implicit, uninspected epistemic policies. This paper argues for an epistemic constitution for AI: explicit, contestable meta-norms that regulate how systems form and express beliefs. Source attribution bias provides the motivating case: I show that frontier models enforce identity-stance coherence, penalizing arguments attributed to sources whose expected ideological position conflicts with the argument's content. When models detect systematic testing, these effects collapse, revealing that systems treat source-sensitivity as bias to suppress rather than as a capacity to execute well. I distinguish two constitutional approaches: the Platonic, which mandates formal correctness and default source-independence from a privileged standpoint, and the Liberal, which refuses such privilege, specifying procedural norms that protect conditions for collective inquiry while allowing principled source-attending grounded in epistemic vigilance. I argue for the Liberal approach, sketch a constitutional core of eight principles and four orientations, and propose that AI epistemic governance requires the same explicit, contestable structure we now expect for AI ethics.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "VisTIRA: Closing the Image-Text Modality Gap in Visual Math Reasoning via Structured Tool Integration",
      "url": "https://arxiv.org/abs/2601.14440",
      "content": "arXiv:2601.14440v1 Announce Type: new \nAbstract: Vision-language models (VLMs) lag behind text-only language models on mathematical reasoning when the same problems are presented as images rather than text. We empirically characterize this as a modality gap: the same question in text form yields markedly higher accuracy than its visually typeset counterpart, due to compounded failures in reading dense formulas, layout, and mixed symbolic-diagrammatic context. First, we introduce VisTIRA (Vision and Tool-Integrated Reasoning Agent), a tool-integrated reasoning framework that enables structured problem solving by iteratively decomposing a given math problem (as an image) into natural language rationales and executable Python steps to determine the final answer. Second, we build a framework to measure and improve visual math reasoning: a LaTeX-based pipeline that converts chain-of-thought math corpora (e.g., NuminaMath) into challenging image counterparts, and a large set of synthetic tool-use trajectories derived from a real-world, homework-style image dataset (called SnapAsk) for fine-tuning VLMs. Our experiments show that tool-integrated supervision improves image-based reasoning, and OCR grounding can further narrow the gap for smaller models, although its benefit diminishes at scale. These findings highlight that modality gap severity inversely correlates with model size, and that structured reasoning and OCR-based grounding are complementary strategies for advancing visual mathematical reasoning.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "On the Generalization Gap in LLM Planning: Tests and Verifier-Reward RL",
      "url": "https://arxiv.org/abs/2601.14456",
      "content": "arXiv:2601.14456v1 Announce Type: new \nAbstract: Recent work shows that fine-tuned Large Language Models (LLMs) can achieve high valid plan rates on PDDL planning tasks. However, it remains unclear whether this reflects transferable planning competence or domain-specific memorization. In this work, we fine-tune a 1.7B-parameter LLM on 40,000 domain-problem-plan tuples from 10 IPC 2023 domains, and evaluate both in-domain and cross-domain generalization. While the model reaches 82.9% valid plan rate in in-domain conditions, it achieves 0% on two unseen domains. To analyze this failure, we introduce three diagnostic interventions, namely (i) instance-wise symbol anonymization, (ii) compact plan serialization, and (iii) verifier-reward fine-tuning using the VAL validator as a success-focused reinforcement signal. Symbol anonymization and compact serialization cause significant performance drops despite preserving plan semantics, thus revealing strong sensitivity to surface representations. Verifier-reward fine-tuning reaches performance saturation in half the supervised training epochs, but does not improve cross-domain generalization. For the explored configurations, in-domain performance plateaus around 80%, while cross-domain performance collapses, suggesting that our fine-tuned model relies heavily on domain-specific patterns rather than transferable planning competence in this setting. Our results highlight a persistent generalization gap in LLM-based planning and provide diagnostic tools for studying its causes.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Scalable Knee-Point Guided Activity Group Selection in Multi-Tree Genetic Programming for Dynamic Multi-Mode Project Scheduling",
      "url": "https://arxiv.org/abs/2601.14485",
      "content": "arXiv:2601.14485v1 Announce Type: new \nAbstract: The dynamic multi-mode resource-constrained project scheduling problem is a challenging scheduling problem that requires making decisions on both the execution order of activities and their corresponding execution modes. Genetic programming has been widely applied as a hyper-heuristic to evolve priority rules that guide the selection of activity-mode pairs from the current eligible set. Recently, an activity group selection strategy has been proposed to select a subset of activities rather than a single activity at each decision point, allowing for more effective scheduling by considering the interdependence between activities. Although effective in small-scale instances, this strategy suffers from scalability issues when applied to larger problems. In this work, we enhance the scalability of the group selection strategy by introducing a knee-point-based selection mechanism to identify a promising subset of activities before evaluating their combinations. An activity ordering rule is first used to rank all eligible activity-mode pairs, followed by a knee point selection to find the promising pairs. Then, a group selection rule selects the best activity combination. We develop a multi-tree GP framework to evolve both types of rules simultaneously. Experimental results demonstrate that our approach scales well to large instances and outperforms GP with sequential decision-making in most scenarios.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "\"Just in Time\" World Modeling Supports Human Planning and Reasoning",
      "url": "https://arxiv.org/abs/2601.14514",
      "content": "arXiv:2601.14514v1 Announce Type: new \nAbstract: Probabilistic mental simulation is thought to play a key role in human reasoning, planning, and prediction, yet the demands of simulation in complex environments exceed realistic human capacity limits. A theory with growing evidence is that people simulate using simplified representations of the environment that abstract away from irrelevant details, but it is unclear how people determine these simplifications efficiently. Here, we present a \"Just-in-Time\" framework for simulation-based reasoning that demonstrates how such representations can be constructed online with minimal added computation. The model uses a tight interleaving of simulation, visual search, and representation modification, with the current simulation guiding where to look and visual search flagging objects that should be encoded for subsequent simulation. Despite only ever encoding a small subset of objects, the model makes high-utility predictions. We find strong empirical support for this account over alternative models in a grid-world planning task and a physical reasoning task across a range of behavioral measures. Together, these results offer a concrete algorithmic account of how people construct reduced representations to support efficient mental simulation.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Large Language Model-Powered Evolutionary Code Optimization on a Phylogenetic Tree",
      "url": "https://arxiv.org/abs/2601.14523",
      "content": "arXiv:2601.14523v1 Announce Type: new \nAbstract: Optimizing scientific computing algorithms for modern GPUs is a labor-intensive and iterative process involving repeated code modification, benchmarking, and tuning across complex hardware and software stacks. Recent work has explored large language model (LLM)-assisted evolutionary methods for automated code optimization, but these approaches primarily rely on outcome-based selection and random mutation, underutilizing the rich trajectory information generated during iterative optimization. We propose PhyloEvolve, an LLM-agent system that reframes GPU-oriented algorithm optimization as an In-Context Reinforcement Learning (ICRL) problem. This formulation enables trajectory-conditioned reuse of optimization experience without model retraining. PhyloEvolve integrates Algorithm Distillation and prompt-based Decision Transformers into an iterative workflow, treating sequences of algorithm modifications and performance feedback as first-class learning signals. To organize optimization history, we introduce a phylogenetic tree representation that captures inheritance, divergence, and recombination among algorithm variants, enabling backtracking, cross-lineage transfer, and reproducibility. The system combines elite trajectory pooling, multi-island parallel exploration, and containerized execution to balance exploration and exploitation across heterogeneous hardware. We evaluate PhyloEvolve on scientific computing workloads including PDE solvers, manifold learning, and spectral graph algorithms, demonstrating consistent improvements in runtime, memory efficiency, and correctness over baseline and evolutionary methods. Code is published at: https://github.com/annihi1ation/phylo_evolve",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "MAS-Orchestra: Understanding and Improving Multi-Agent Reasoning Through Holistic Orchestration and Controlled Benchmarks",
      "url": "https://arxiv.org/abs/2601.14652",
      "content": "arXiv:2601.14652v1 Announce Type: new \nAbstract: While multi-agent systems (MAS) promise elevated intelligence through coordination of agents, current approaches to automatic MAS design under-deliver. Such shortcomings stem from two key factors: (1) methodological complexity - agent orchestration is performed using sequential, code-level execution that limits global system-level holistic reasoning and scales poorly with agent complexity - and (2) efficacy uncertainty - MAS are deployed without understanding if there are tangible benefits compared to single-agent systems (SAS). We propose MAS-Orchestra, a training-time framework that formulates MAS orchestration as a function-calling reinforcement learning problem with holistic orchestration, generating an entire MAS at once. In MAS-Orchestra, complex, goal-oriented sub-agents are abstracted as callable functions, enabling global reasoning over system structure while hiding internal execution details. To rigorously study when and why MAS are beneficial, we introduce MASBENCH, a controlled benchmark that characterizes tasks along five axes: Depth, Horizon, Breadth, Parallel, and Robustness. Our analysis reveals that MAS gains depend critically on task structure, verification protocols, and the capabilities of both orchestrator and sub-agents, rather than holding universally. Guided by these insights, MAS-Orchestra achieves consistent improvements on public benchmarks including mathematical reasoning, multi-hop QA, and search-based QA. Together, MAS-Orchestra and MASBENCH enable better training and understanding of MAS in the pursuit of multi-agent intelligence.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Query-Efficient Agentic Graph Extraction Attacks on GraphRAG Systems",
      "url": "https://arxiv.org/abs/2601.14662",
      "content": "arXiv:2601.14662v1 Announce Type: new \nAbstract: Graph-based retrieval-augmented generation (GraphRAG) systems construct knowledge graphs over document collections to support multi-hop reasoning. While prior work shows that GraphRAG responses may leak retrieved subgraphs, the feasibility of query-efficient reconstruction of the hidden graph structure remains unexplored under realistic query budgets. We study a budget-constrained black-box setting where an adversary adaptively queries the system to steal its latent entity-relation graph. We propose AGEA (Agentic Graph Extraction Attack), a framework that leverages a novelty-guided exploration-exploitation strategy, external graph memory modules, and a two-stage graph extraction pipeline combining lightweight discovery with LLM-based filtering. We evaluate AGEA on medical, agriculture, and literary datasets across Microsoft-GraphRAG and LightRAG systems. Under identical query budgets, AGEA significantly outperforms prior attack baselines, recovering up to 90% of entities and relationships while maintaining high precision. These results demonstrate that modern GraphRAG systems are highly vulnerable to structured, agentic extraction attacks, even under strict query limits.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Local Language Models for Context-Aware Adaptive Anonymization of Sensitive Text",
      "url": "https://arxiv.org/abs/2601.14683",
      "content": "arXiv:2601.14683v1 Announce Type: new \nAbstract: Qualitative research often contains personal, contextual, and organizational details that pose privacy risks if not handled appropriately. Manual anonymization is time-consuming, inconsistent, and frequently omits critical identifiers. Existing automated tools tend to rely on pattern matching or fixed rules, which fail to capture context and may alter the meaning of the data. This study uses local LLMs to build a reliable, repeatable, and context-aware anonymization process for detecting and anonymizing sensitive data in qualitative transcripts. We introduce a Structured Framework for Adaptive Anonymizer (SFAA) that includes three steps: detection, classification, and adaptive anonymization. The SFAA incorporates four anonymization strategies: rule-based substitution, context-aware rewriting, generalization, and suppression. These strategies are applied based on the identifier type and the risk level. The identifiers handled by the SFAA are guided by major international privacy and research ethics standards, including the GDPR, HIPAA, and OECD guidelines. This study followed a dual-method evaluation that combined manual and LLM-assisted processing. Two case studies were used to support the evaluation. The first includes 82 face-to-face interviews on gamification in organizations. The second involves 93 machine-led interviews using an AI-powered interviewer to test LLM awareness and workplace privacy. Two local models, LLaMA and Phi were used to evaluate the performance of the proposed framework. The results indicate that the LLMs found more sensitive data than a human reviewer. Phi outperformed LLaMA in finding sensitive data, but made slightly more errors. Phi was able to find over 91% of the sensitive data and 94.8% kept the same sentiment as the original text, which means it was very accurate, hence, it does not affect the analysis of the qualitative data.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "IB-GRPO: Aligning LLM-based Learning Path Recommendation with Educational Objectives via Indicator-Based Group Relative Policy Optimization",
      "url": "https://arxiv.org/abs/2601.14686",
      "content": "arXiv:2601.14686v1 Announce Type: new \nAbstract: Learning Path Recommendation (LPR) aims to generate personalized sequences of learning items that maximize long-term learning effect while respecting pedagogical principles and operational constraints. Although large language models (LLMs) offer rich semantic understanding for free-form recommendation, applying them to long-horizon LPR is challenging due to (i) misalignment with pedagogical objectives such as the Zone of Proximal Development (ZPD) under sparse, delayed feedback, (ii) scarce and costly expert demonstrations, and (iii) multi-objective interactions among learning effect, difficulty scheduling, length controllability, and trajectory diversity. To address these issues, we propose IB-GRPO (Indicator-Based Group Relative Policy Optimization), an indicator-guided alignment approach for LLM-based LPR. To mitigate data scarcity, we construct hybrid expert demonstrations via Genetic Algorithm search and teacher RL agents and warm-start the LLM with supervised fine-tuning. Building on this warm-start, we design a within-session ZPD alignment score for difficulty scheduling. IB-GRPO then uses the $I_{\\epsilon+}$ dominance indicator to compute group-relative advantages over multiple objectives, avoiding manual scalarization and improving Pareto trade-offs. Experiments on ASSIST09 and Junyi using the KES simulator with a Qwen2.5-7B backbone show consistent improvements over representative RL and LLM baselines.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Gaming the Judge: Unfaithful Chain-of-Thought Can Undermine Agent Evaluation",
      "url": "https://arxiv.org/abs/2601.14691",
      "content": "arXiv:2601.14691v1 Announce Type: new \nAbstract: Large language models (LLMs) are increasingly used as judges to evaluate agent performance, particularly in non-verifiable settings where judgments rely on agent trajectories including chain-of-thought (CoT) reasoning. This paradigm implicitly assumes that the agent's CoT faithfully reflects both its internal reasoning and the underlying environment state. We show this assumption is brittle: LLM judges are highly susceptible to manipulation of agent reasoning traces. By systematically rewriting agent CoTs while holding actions and observations fixed, we demonstrate that manipulated reasoning alone can inflate false positive rates of state-of-the-art VLM judges by up to 90% across 800 trajectories spanning diverse web tasks. We study manipulation strategies spanning style-based approaches that alter only the presentation of reasoning and content-based approaches that fabricate signals of task progress, and find that content-based manipulations are consistently more effective. We evaluate prompting-based techniques and scaling judge-time compute, which reduce but do not fully eliminate susceptibility to manipulation. Our findings reveal a fundamental vulnerability in LLM-based evaluation and highlight the need for judging mechanisms that verify reasoning claims against observable evidence.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "AutoDriDM: An Explainable Benchmark for Decision-Making of Vision-Language Models in Autonomous Driving",
      "url": "https://arxiv.org/abs/2601.14702",
      "content": "arXiv:2601.14702v1 Announce Type: new \nAbstract: Autonomous driving is a highly challenging domain that requires reliable perception and safe decision-making in complex scenarios. Recent vision-language models (VLMs) demonstrate reasoning and generalization abilities, opening new possibilities for autonomous driving; however, existing benchmarks and metrics overemphasize perceptual competence and fail to adequately assess decision-making processes. In this work, we present AutoDriDM, a decision-centric, progressive benchmark with 6,650 questions across three dimensions - Object, Scene, and Decision. We evaluate mainstream VLMs to delineate the perception-to-decision capability boundary in autonomous driving, and our correlation analysis reveals weak alignment between perception and decision-making performance. We further conduct explainability analyses of models' reasoning processes, identifying key failure modes such as logical reasoning errors, and introduce an analyzer model to automate large-scale annotation. AutoDriDM bridges the gap between perception-centered and decision-centered evaluation, providing guidance toward safer and more reliable VLMs for real-world autonomous driving.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "DARA: Few-shot Budget Allocation in Online Advertising via In-Context Decision Making with RL-Finetuned LLMs",
      "url": "https://arxiv.org/abs/2601.14711",
      "content": "arXiv:2601.14711v1 Announce Type: new \nAbstract: Optimizing the advertiser's cumulative value of winning impressions under budget constraints poses a complex challenge in online advertising, under the paradigm of AI-Generated Bidding (AIGB). Advertisers often have personalized objectives but limited historical interaction data, resulting in few-shot scenarios where traditional reinforcement learning (RL) methods struggle to perform effectively. Large Language Models (LLMs) offer a promising alternative for AIGB by leveraging their in-context learning capabilities to generalize from limited data. However, they lack the numerical precision required for fine-grained optimization. To address this limitation, we introduce GRPO-Adaptive, an efficient LLM post-training strategy that enhances both reasoning and numerical precision by dynamically updating the reference policy during training. Built upon this foundation, we further propose DARA, a novel dual-phase framework that decomposes the decision-making process into two stages: a few-shot reasoner that generates initial plans via in-context prompting, and a fine-grained optimizer that refines these plans using feedback-driven reasoning. This separation allows DARA to combine LLMs' in-context learning strengths with precise adaptability required by AIGB tasks. Extensive experiments on both real-world and synthetic data environments demonstrate that our approach consistently outperforms existing baselines in terms of cumulative advertiser value under budget constraints.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "An XAI View on Explainable ASP: Methods, Systems, and Perspectives",
      "url": "https://arxiv.org/abs/2601.14764",
      "content": "arXiv:2601.14764v1 Announce Type: new \nAbstract: Answer Set Programming (ASP) is a popular declarative reasoning and problem solving approach in symbolic AI. Its rule-based formalism makes it inherently attractive for explainable and interpretive reasoning, which is gaining importance with the surge of Explainable AI (XAI). A number of explanation approaches and tools for ASP have been developed, which often tackle specific explanatory settings and may not cover all scenarios that ASP users encounter. In this survey, we provide, guided by an XAI perspective, an overview of types of ASP explanations in connection with user questions for explanation, and describe how their coverage by current theory and tools. Furthermore, we pinpoint gaps in existing ASP explanations approaches and identify research directions for future work.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Semantic-Guided Unsupervised Video Summarization",
      "url": "https://arxiv.org/abs/2601.14773",
      "content": "arXiv:2601.14773v1 Announce Type: new \nAbstract: Video summarization is a crucial technique for social understanding, enabling efficient browsing of massive multimedia content and extraction of key information from social platforms. Most existing unsupervised summarization methods rely on Generative Adversarial Networks (GANs) to enhance keyframe selection and generate coherent, video summaries through adversarial training. However, such approaches primarily exploit unimodal features, overlooking the guiding role of semantic information in keyframe selection, and often suffer from unstable training. To address these limitations, we propose a novel Semantic-Guided Unsupervised Video Summarization method. Specifically, we design a novel frame-level semantic alignment attention mechanism and integrate it into a keyframe selector, which guides the Transformer-based generator within the adversarial framework to better reconstruct videos. In addition, we adopt an incremental training strategy to progressively update the model components, effectively mitigating the instability of GAN training. Experimental results demonstrate that our approach achieves superior performance on multiple benchmark datasets.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Towards Bound Consistency for the No-Overlap Constraint Using MDDs",
      "url": "https://arxiv.org/abs/2601.14784",
      "content": "arXiv:2601.14784v1 Announce Type: new \nAbstract: Achieving bound consistency for the no-overlap constraint is known to be NP-complete. Therefore, several polynomial-time tightening techniques, such as edge finding, not-first-not-last reasoning, and energetic reasoning, have been introduced for this constraint. In this work, we derive the first bound-consistent algorithm for the no-overlap constraint. By building on the no-overlap MDD defined by Cir\\'e and van Hoeve, we extract bounds of the time window of the jobs, allowing us to tighten start and end times in time polynomial in the number of nodes of the MDD. Similarly, to bound the size and time-complexity, we limit the width of the MDD to a threshold, creating a relaxed MDD that can also be used to relax the bound-consistent filtering. Through experiments on a sequencing problem with time windows and a just-in-time objective ($1 \\mid r_j, d_j, \\bar{d}_j \\mid \\sum E_j + \\sum T_j$), we observe that the proposed filtering, even with a threshold on the width, achieves a stronger reduction in the number of nodes visited in the search tree compared to the previously proposed precedence-detection algorithm of Cir\\'e and van Hoeve. The new filtering also appears to be complementary to classical propagation methods for the no-overlap constraint, allowing a substantial reduction in both the number of nodes and the solving time on several instances.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "CI4A: Semantic Component Interfaces for Agents Empowering Web Automation",
      "url": "https://arxiv.org/abs/2601.14790",
      "content": "arXiv:2601.14790v1 Announce Type: new \nAbstract: While Large Language Models demonstrate remarkable proficiency in high-level semantic planning, they remain limited in handling fine-grained, low-level web component manipulations. To address this limitation, extensive research has focused on enhancing model grounding capabilities through techniques such as Reinforcement Learning. However, rather than compelling agents to adapt to human-centric interfaces, we propose constructing interaction interfaces specifically optimized for agents. This paper introduces Component Interface for Agent (CI4A), a semantic encapsulation mechanism that abstracts the complex interaction logic of UI components into a set of unified tool primitives accessible to agents. We implemented CI4A within Ant Design, an industrial-grade front-end framework, covering 23 categories of commonly used UI components. Furthermore, we developed a hybrid agent featuring an action space that dynamically updates according to the page state, enabling flexible invocation of available CI4A tools. Leveraging the CI4A-integrated Ant Design, we refactored and upgraded the WebArena benchmark to evaluate existing SoTA methods. Experimental results demonstrate that the CI4A-based agent significantly outperforms existing approaches, achieving a new SoTA task success rate of 86.3%, alongside substantial improvements in execution efficiency.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Measuring and Aligning Abstraction in Vision-Language Models with Medical Taxonomies",
      "url": "https://arxiv.org/abs/2601.14827",
      "content": "arXiv:2601.14827v1 Announce Type: new \nAbstract: Vision-Language Models show strong zero-shot performance for chest X-ray classification, but standard flat metrics fail to distinguish between clinically minor and severe errors. This work investigates how to quantify and mitigate abstraction errors by leveraging medical taxonomies. We benchmark several state-of-the-art VLMs using hierarchical metrics and introduce Catastrophic Abstraction Errors to capture cross-branch mistakes. Our results reveal substantial misalignment of VLMs with clinical taxonomies despite high flat performance. To address this, we propose risk-constrained thresholding and taxonomy-aware fine-tuning with radial embeddings, which reduce severe abstraction errors to below 2 per cent while maintaining competitive performance. These findings highlight the importance of hierarchical evaluation and representation-level alignment for safer and more clinically meaningful deployment of VLMs.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Implementing Knowledge Representation and Reasoning with Object Oriented Design",
      "url": "https://arxiv.org/abs/2601.14840",
      "content": "arXiv:2601.14840v1 Announce Type: new \nAbstract: This paper introduces KRROOD, a framework designed to bridge the integration gap between modern software engineering and Knowledge Representation & Reasoning (KR&R) systems. While Object-Oriented Programming (OOP) is the standard for developing complex applications, existing KR&R frameworks often rely on external ontologies and specialized languages that are difficult to integrate with imperative code. KRROOD addresses this by treating knowledge as a first-class programming abstraction using native class structures, bridging the gap between the logic programming and OOP paradigms. We evaluate the system on the OWL2Bench benchmark and a human-robot task learning scenario. Experimental results show that KRROOD achieves strong performance while supporting the expressive reasoning required for real-world autonomous systems.",
      "published_date": "2026-01-22T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    }
  ]
}