{
  "timestamp": "2026-01-19T13:32:40.381390",
  "key": "source_arxiv_ai_7days",
  "value": [
    {
      "title": "Japanese AI Agent System on Human Papillomavirus Vaccination: System Design",
      "url": "https://arxiv.org/abs/2601.10718",
      "content": "arXiv:2601.10718v1 Announce Type: new \nAbstract: Human papillomavirus (HPV) vaccine hesitancy poses significant public health challenges, particularly in Japan where proactive vaccination recommendations were suspended from 2013 to 2021. The resulting information gap is exacerbated by misinformation on social media, and traditional ways cannot simultaneously address individual queries while monitoring population-level discourse. This study aimed to develop a dual-purpose AI agent system that provides verified HPV vaccine information through a conversational interface while generating analytical reports for medical institutions based on user interactions and social media. We implemented a system comprising: a vector database integrating academic papers, government sources, news media, and social media; a Retrieval-Augmented Generation chatbot using ReAct agent architecture with multi-tool orchestration across five knowledge sources; and an automated report generation system with modules for news analysis, research synthesis, social media sentiment analysis, and user interaction pattern identification. Performance was assessed using a 0-5 scoring scale. For single-turn evaluation, the chatbot achieved mean scores of 4.83 for relevance, 4.89 for routing, 4.50 for reference quality, 4.90 for correctness, and 4.88 for professional identity (overall 4.80). Multi-turn evaluation yielded higher scores: context retention 4.94, topic coherence 5.00, and overall 4.98. The report generation system achieved completeness 4.00-5.00, correctness 4.00-5.00, and helpfulness 3.67-5.00, with reference validity 5.00 across all periods. This study demonstrates the feasibility of an integrated AI agent system for bidirectional HPV vaccine communication. The architecture enables verified information delivery with source attribution while providing systematic public discourse analysis, with a transferable framework for adaptation to other medical contexts.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Do You Trust Me? Cognitive-Affective Signatures of Trustworthiness in Large Language Models",
      "url": "https://arxiv.org/abs/2601.10719",
      "content": "arXiv:2601.10719v1 Announce Type: new \nAbstract: Perceived trustworthiness underpins how users navigate online information, yet it remains unclear whether large language models (LLMs),increasingly embedded in search, recommendation, and conversational systems, represent this construct in psychologically coherent ways. We analyze how instruction-tuned LLMs (Llama 3.1 8B, Qwen 2.5 7B, Mistral 7B) encode perceived trustworthiness in web-like narratives using the PEACE-Reviews dataset annotated for cognitive appraisals, emotions, and behavioral intentions. Across models, systematic layer- and head-level activation differences distinguish high- from low-trust texts, revealing that trust cues are implicitly encoded during pretraining. Probing analyses show linearly de-codable trust signals and fine-tuning effects that refine rather than restructure these representations. Strongest associations emerge with appraisals of fairness, certainty, and accountability-self -- dimensions central to human trust formation online. These findings demonstrate that modern LLMs internalize psychologically grounded trust signals without explicit supervision, offering a representational foundation for designing credible, transparent, and trust-worthy AI systems in the web ecosystem. Code and appendix are available at: https://github.com/GerardYeo/TrustworthinessLLM.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Building AI Agents to Improve Job Referral Requests to Strangers",
      "url": "https://arxiv.org/abs/2601.10726",
      "content": "arXiv:2601.10726v1 Announce Type: new \nAbstract: This paper develops AI agents that help job seekers write effective requests for job referrals in a professional online community. The basic workflow consists of an improver agent that rewrites the referral request and an evaluator agent that measures the quality of revisions using a model trained to predict the probability of receiving referrals from other users. Revisions suggested by the LLM (large language model) increase predicted success rates for weaker requests while reducing them for stronger requests. Enhancing the LLM with Retrieval-Augmented Generation (RAG) prevents edits that worsen stronger requests while it amplifies improvements for weaker requests. Overall, using LLM revisions with RAG increases the predicted success rate for weaker requests by 14\\% without degrading performance on stronger requests. Although improvements in model-predicted success do not guarantee more referrals in the real world, they provide low-cost signals for promising features before running higher-stakes experiments on real users.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "ORBITFLOW: SLO-Aware Long-Context LLM Serving with Fine-Grained KV Cache Reconfiguration",
      "url": "https://arxiv.org/abs/2601.10729",
      "content": "arXiv:2601.10729v1 Announce Type: new \nAbstract: Serving long-context LLMs is challenging because request lengths and batch composition vary during token generation, causing the memory footprint to fluctuate significantly at runtime. Offloading KV caches to host memory limits effective memory usage, but existing static and predetermined offloading strategies cannot adapt to the rapidly shifting memory demands of long-context serving. This often leads to excessive CPU-to-GPU KV transfers that translate into latency spikes and frequent SLO violations. To address these challenges, we introduce ORBITFLOW, a fine-grained and adaptive KV cache management system that meets latency SLOs in long-context LLM serving. ORBITFLOW employs a lightweight ILP solver to decide which layers' KV caches to retain on the GPU for each request, within memory capacity constraints. It continuously refines KV placements based on runtime feedback when the active plan becomes suboptimal during token generation. Under heavy load, ORBITFLOW invokes a fallback mechanism to temporarily defer in-flight requests with large memory footprints, preserving overall SLO attainment. Our experiments demonstrate that ORBITFLOW improves SLO attainment for TPOT and TBT by up to 66% and 48%, respectively, while reducing the 95th percentile latency by 38% and achieving up to 3.3x higher throughput compared to existing offloading methods.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "CTHA: Constrained Temporal Hierarchical Architecture for Stable Multi-Agent LLM Systems",
      "url": "https://arxiv.org/abs/2601.10738",
      "content": "arXiv:2601.10738v1 Announce Type: new \nAbstract: Recently, multi-time-scale agent architectures have extended the ubiquitous single-loop paradigm by introducing temporal hierarchies with distinct cognitive layers. While yielding substantial performance gains, this diversification fundamentally compromises the coordination stability intrinsic to unified agent systems, which causes severe inter-layer conflicts, unbounded error propagation, and restricted scalability. To address these challenges, we propose Constrained Temporal Hierarchical Architecture (CTHA), a general framework that projects the inter-layer communication space onto structured manifolds to restore coordination stability, while incorporating principled arbitration mechanisms to ensure coherent decision-making. Specifically, CTHA enforces three key constraints: (1) Message Contract Constraints that formalize information flow between layers via typed summary, plan, and policy packets; (2) Authority Manifold Constraints that bound each layer's decision space according to its temporal scope; and (3) Arbiter Resolution Constraints that guarantee conflict-free composition of multi-layer decisions. Empirical experiments demonstrate that CTHA is effective for complex task execution at scale, offering 47% reduction in failure cascades, 2.3x improvement in sample efficiency, and superior scalability compared to unconstrained hierarchical baselines. We anticipate that CTHA, as a principled extension of temporal hierarchies, will contribute to a deeper understanding of multi-agent coordination and suggest promising directions for the evolution of robust autonomous systems.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Explore with Long-term Memory: A Benchmark and Multimodal LLM-based Reinforcement Learning Framework for Embodied Exploration",
      "url": "https://arxiv.org/abs/2601.10744",
      "content": "arXiv:2601.10744v1 Announce Type: new \nAbstract: An ideal embodied agent should possess lifelong learning capabilities to handle long-horizon and complex tasks, enabling continuous operation in general environments. This not only requires the agent to accurately accomplish given tasks but also to leverage long-term episodic memory to optimize decision-making. However, existing mainstream one-shot embodied tasks primarily focus on task completion results, neglecting the crucial process of exploration and memory utilization. To address this, we propose Long-term Memory Embodied Exploration (LMEE), which aims to unify the agent's exploratory cognition and decision-making behaviors to promote lifelong learning.We further construct a corresponding dataset and benchmark, LMEE-Bench, incorporating multi-goal navigation and memory-based question answering to comprehensively evaluate both the process and outcome of embodied exploration. To enhance the agent's memory recall and proactive exploration capabilities, we propose MemoryExplorer, a novel method that fine-tunes a multimodal large language model through reinforcement learning to encourage active memory querying. By incorporating a multi-task reward function that includes action prediction, frontier selection, and question answering, our model achieves proactive exploration. Extensive experiments against state-of-the-art embodied exploration models demonstrate that our approach achieves significant advantages in long-horizon embodied tasks.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Optimisation of complex product innovation processes based on trend models with three-valued logic",
      "url": "https://arxiv.org/abs/2601.10768",
      "content": "arXiv:2601.10768v1 Announce Type: new \nAbstract: This paper investigates complex product-innovation processes using models grounded in a set of heuristics. Each heuristic is expressed through simple trends -- increasing, decreasing, or constant -- which serve as minimally information-intensive quantifiers, avoiding reliance on numerical values or rough sets. A solution to a trend model is defined as a set of scenarios with possible transitions between them, represented by a transition graph. Any possible future or past behaviour of the system under study can thus be depicted by a path within this graph.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "ARC Prize 2025: Technical Report",
      "url": "https://arxiv.org/abs/2601.10904",
      "content": "arXiv:2601.10904v1 Announce Type: new \nAbstract: The ARC-AGI benchmark series serves as a critical measure of few-shot generalization on novel tasks, a core aspect of intelligence. The ARC Prize 2025 global competition targeted the newly released ARC-AGI-2 dataset, which features greater task complexity compared to its predecessor. The Kaggle competition attracted 1,455 teams and 15,154 entries, with the top score reaching 24% on the ARC-AGI-2 private evaluation set. Paper submissions nearly doubled year-over-year to 90 entries, reflecting the growing research interest in fluid intelligence and abstract reasoning. The defining theme of 2025 is the emergence of the refinement loop -- a per-task iterative program optimization loop guided by a feedback signal. Refinement loops come in a variety of forms, in particular evolutionary program synthesis approaches and application-layer refinements to commercial AI systems. Such refinement loops are also possible in weight space, as evidenced by zero-pretraining deep learning methods which are now achieving competitive performance with remarkably small networks (7M parameters). In parallel, four frontier AI labs (Anthropic, Google DeepMind, OpenAI, and xAI) reported ARC-AGI performance in public model cards in 2025, establishing ARC-AGI as an industry standard benchmark for AI reasoning. However, our analysis indicates that current frontier AI reasoning performance remains fundamentally constrained to knowledge coverage, giving rise to new forms of benchmark contamination. In this paper, we survey the top-performing methods, examine the role of refinement loops in AGI progress, discuss knowledge-dependent overfitting, and preview ARC-AGI-3, which introduces interactive reasoning challenges that require exploration, planning, memory, goal acquisition, and alignment capabilities.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "What Matters in Data Curation for Multimodal Reasoning? Insights from the DCVLR Challenge",
      "url": "https://arxiv.org/abs/2601.10922",
      "content": "arXiv:2601.10922v1 Announce Type: new \nAbstract: We study data curation for multimodal reasoning through the NeurIPS 2025 Data Curation for Vision-Language Reasoning (DCVLR) challenge, which isolates dataset selection by fixing the model and training protocol. Using a compact curated dataset derived primarily from Walton Multimodal Cold Start, our submission placed first in the challenge. Through post-competition ablations, we show that difficulty-based example selection on an aligned base dataset is the dominant driver of performance gains. Increasing dataset size does not reliably improve mean accuracy under the fixed training recipe, but mainly reduces run-to-run variance, while commonly used diversity and synthetic augmentation heuristics provide no additional benefit and often degrade performance. These results characterize DCVLR as a saturation-regime evaluation and highlight the central role of alignment and difficulty in data-efficient multimodal reasoning.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "AdaMARP: An Adaptive Multi-Agent Interaction Framework for General Immersive Role-Playing",
      "url": "https://arxiv.org/abs/2601.11007",
      "content": "arXiv:2601.11007v1 Announce Type: new \nAbstract: LLM role-playing aims to portray arbitrary characters in interactive narratives, yet existing systems often suffer from limited immersion and adaptability. They typically under-model dynamic environmental information and assume largely static scenes and casts, offering insufficient support for multi-character orchestration, scene transitions, and on-the-fly character introduction. We propose an adaptive multi-agent role-playing framework, AdaMARP, featuring an immersive message format that interleaves [Thought], (Action), , and Speech, together with an explicit Scene Manager that governs role-playing through discrete actions (init_scene, pick_speaker, switch_scene, add_role, end) accompanied by rationales. To train these capabilities, we construct AdaRPSet for the Actor Model and AdaSMSet for supervising orchestration decisions, and introduce AdaptiveBench for trajectory-level evaluation. Experiments across multiple backbones and model scales demonstrate consistent improvements: AdaRPSet enhances character consistency, environment grounding, and narrative coherence, with an 8B actor outperforming several commercial LLMs, while AdaSMSet enables smoother scene transitions and more natural role introductions, surpassing Claude Sonnet 4.5 using only a 14B LLM.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Efficient Protein Optimization via Structure-aware Hamiltonian Dynamics",
      "url": "https://arxiv.org/abs/2601.11012",
      "content": "arXiv:2601.11012v1 Announce Type: new \nAbstract: The ability to engineer optimized protein variants has transformative potential for biotechnology and medicine. Prior sequence-based optimization methods struggle with the high-dimensional complexities due to the epistasis effect and the disregard for structural constraints. To address this, we propose HADES, a Bayesian optimization method utilizing Hamiltonian dynamics to efficiently sample from a structure-aware approximated posterior. Leveraging momentum and uncertainty in the simulated physical movements, HADES enables rapid transition of proposals toward promising areas. A position discretization procedure is introduced to propose discrete protein sequences from such a continuous state system. The posterior surrogate is powered by a two-stage encoder-decoder framework to determine the structure and function relationships between mutant neighbors, consequently learning a smoothed landscape to sample from. Extensive experiments demonstrate that our method outperforms state-of-the-art baselines in in-silico evaluations across most metrics. Remarkably, our approach offers a unique advantage by leveraging the mutual constraints between protein structure and sequence, facilitating the design of protein sequences with similar structures and optimized properties. The code and data are publicly available at https://github.com/GENTEL-lab/HADES.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "BAPO: Boundary-Aware Policy Optimization for Reliable Agentic Search",
      "url": "https://arxiv.org/abs/2601.11037",
      "content": "arXiv:2601.11037v1 Announce Type: new \nAbstract: RL-based agentic search enables LLMs to solve complex questions via dynamic planning and external search. While this approach significantly enhances accuracy with agent policies optimized via large-scale reinforcement learning, we identify a critical gap in reliability: these agents fail to recognize their reasoning boundaries and rarely admit ``I DON'T KNOW'' (IDK) even when evidence is insufficient or reasoning reaches its limit. The lack of reliability often leads to plausible but unreliable answers, introducing significant risks in many real-world scenarios. To this end, we propose Boundary-Aware Policy Optimization (BAPO), a novel RL framework designed to cultivate reliable boundary awareness without compromising accuracy. BAPO introduces two key components: (i) a group-based boundary-aware reward that encourages an IDK response only when the reasoning reaches its limit, and (ii) an adaptive reward modulator that strategically suspends this reward during early exploration, preventing the model from exploiting IDK as a shortcut. Extensive experiments on four benchmarks demonstrate that BAPO substantially enhances the overall reliability of agentic search.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "AgencyBench: Benchmarking the Frontiers of Autonomous Agents in 1M-Token Real-World Contexts",
      "url": "https://arxiv.org/abs/2601.11044",
      "content": "arXiv:2601.11044v1 Announce Type: new \nAbstract: Large Language Models (LLMs) based autonomous agents demonstrate multifaceted capabilities to contribute substantially to economic production. However, existing benchmarks remain focused on single agentic capability, failing to capture long-horizon real-world scenarios. Moreover, the reliance on human-in-the-loop feedback for realistic tasks creates a scalability bottleneck, hindering automated rollout collection and evaluation. To bridge this gap, we introduce AgencyBench, a comprehensive benchmark derived from daily AI usage, evaluating 6 core agentic capabilities across 32 real-world scenarios, comprising 138 tasks with specific queries, deliverables, and rubrics. These scenarios require an average of 90 tool calls, 1 million tokens, and hours of execution time to resolve. To enable automated evaluation, we employ a user simulation agent to provide iterative feedback, and a Docker sandbox to conduct visual and functional rubric-based assessment. Experiments reveal that closed-source models significantly outperform open-source models (48.4% vs 32.1%). Further analysis reveals significant disparities across models in resource efficiency, feedback-driven self-correction, and specific tool-use preferences. Finally, we investigate the impact of agentic scaffolds, observing that proprietary models demonstrate superior performance within their native ecosystems (e.g., Claude-4.5-Opus via Claude-Agent-SDK), while open-source models exhibit distinct performance peaks, suggesting potential optimization for specific execution frameworks. AgencyBench serves as a critical testbed for next-generation agents, highlighting the necessity of co-optimizing model architecture with agentic frameworks. We believe this work sheds light on the future direction of autonomous agents, and we release the full benchmark and evaluation toolkit at https://github.com/GAIR-NLP/AgencyBench.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "MiCA: A Mobility-Informed Causal Adapter for Lightweight Epidemic Forecasting",
      "url": "https://arxiv.org/abs/2601.11089",
      "content": "arXiv:2601.11089v1 Announce Type: new \nAbstract: Accurate forecasting of infectious disease dynamics is critical for public health planning and intervention. Human mobility plays a central role in shaping the spatial spread of epidemics, but mobility data are noisy, indirect, and difficult to integrate reliably with disease records. Meanwhile, epidemic case time series are typically short and reported at coarse temporal resolution. These conditions limit the effectiveness of parameter-heavy mobility-aware forecasters that rely on clean and abundant data. In this work, we propose the Mobility-Informed Causal Adapter (MiCA), a lightweight and architecture-agnostic module for epidemic forecasting. MiCA infers mobility relations through causal discovery and integrates them into temporal forecasting models via gated residual mixing. This design allows lightweight forecasters to selectively exploit mobility-derived spatial structure while remaining robust under noisy and data-limited conditions, without introducing heavy relational components such as graph neural networks or full attention. Extensive experiments on four real-world epidemic datasets, including COVID-19 incidence, COVID-19 mortality, influenza, and dengue, show that MiCA consistently improves lightweight temporal backbones, achieving an average relative error reduction of 7.5\\% across forecasting horizons. Moreover, MiCA attains performance competitive with SOTA spatio-temporal models while remaining lightweight.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "ReCreate: Reasoning and Creating Domain Agents Driven by Experience",
      "url": "https://arxiv.org/abs/2601.11100",
      "content": "arXiv:2601.11100v1 Announce Type: new \nAbstract: Large Language Model agents are reshaping the industrial landscape. However, most practical agents remain human-designed because tasks differ widely, making them labor-intensive to build. This situation poses a central question: can we automatically create and adapt domain agents in the wild? While several recent approaches have sought to automate agent creation, they typically treat agent generation as a black-box procedure and rely solely on final performance metrics to guide the process. Such strategies overlook critical evidence explaining why an agent succeeds or fails, and often require high computational costs. To address these limitations, we propose ReCreate, an experience-driven framework for the automatic creation of domain agents. ReCreate systematically leverages agent interaction histories, which provide rich concrete signals on both the causes of success or failure and the avenues for improvement. Specifically, we introduce an agent-as-optimizer paradigm that effectively learns from experience via three key components: (i) an experience storage and retrieval mechanism for on-demand inspection; (ii) a reasoning-creating synergy pipeline that maps execution experience into scaffold edits; and (iii) hierarchical updates that abstract instance-level details into reusable domain patterns. In experiments across diverse domains, ReCreate consistently outperforms human-designed agents and existing automated agent generation methods, even when starting from minimal seed scaffolds.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Do We Always Need Query-Level Workflows? Rethinking Agentic Workflow Generation for Multi-Agent Systems",
      "url": "https://arxiv.org/abs/2601.11147",
      "content": "arXiv:2601.11147v1 Announce Type: new \nAbstract: Multi-Agent Systems (MAS) built on large language models typically solve complex tasks by coordinating multiple agents through workflows. Existing approaches generates workflows either at task level or query level, but their relative costs and benefits remain unclear. After rethinking and empirical analyses, we show that query-level workflow generation is not always necessary, since a small set of top-K best task-level workflows together already covers equivalent or even more queries. We further find that exhaustive execution-based task-level evaluation is both extremely token-costly and frequently unreliable. Inspired by the idea of self-evolution and generative reward modeling, we propose a low-cost task-level generation framework \\textbf{SCALE}, which means \\underline{\\textbf{S}}elf prediction of the optimizer with few shot \\underline{\\textbf{CAL}}ibration for \\underline{\\textbf{E}}valuation instead of full validation execution. Extensive experiments demonstrate that \\textbf{SCALE} maintains competitive performance, with an average degradation of just 0.61\\% compared to existing approach across multiple datasets, while cutting overall token usage by up to 83\\%.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "TANDEM: Temporal-Aware Neural Detection for Multimodal Hate Speech",
      "url": "https://arxiv.org/abs/2601.11178",
      "content": "arXiv:2601.11178v1 Announce Type: new \nAbstract: Social media platforms are increasingly dominated by long-form multimodal content, where harmful narratives are constructed through a complex interplay of audio, visual, and textual cues. While automated systems can flag hate speech with high accuracy, they often function as \"black boxes\" that fail to provide the granular, interpretable evidence, such as precise timestamps and target identities, required for effective human-in-the-loop moderation. In this work, we introduce TANDEM, a unified framework that transforms audio-visual hate detection from a binary classification task into a structured reasoning problem. Our approach employs a novel tandem reinforcement learning strategy where vision-language and audio-language models optimize each other through self-constrained cross-modal context, stabilizing reasoning over extended temporal sequences without requiring dense frame-level supervision. Experiments across three benchmark datasets demonstrate that TANDEM significantly outperforms zero-shot and context-augmented baselines, achieving 0.73 F1 in target identification on HateMM (a 30% improvement over state-of-the-art) while maintaining precise temporal grounding. We further observe that while binary detection is robust, differentiating between offensive and hateful content remains challenging in multi-class settings due to inherent label ambiguity and dataset imbalance. More broadly, our findings suggest that structured, interpretable alignment is achievable even in complex multimodal settings, offering a blueprint for the next generation of transparent and actionable online safety moderation tools.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Policy-Based Deep Reinforcement Learning Hyperheuristics for Job-Shop Scheduling Problems",
      "url": "https://arxiv.org/abs/2601.11189",
      "content": "arXiv:2601.11189v1 Announce Type: new \nAbstract: This paper proposes a policy-based deep reinforcement learning hyper-heuristic framework for solving the Job Shop Scheduling Problem. The hyper-heuristic agent learns to switch scheduling rules based on the system state dynamically. We extend the hyper-heuristic framework with two key mechanisms. First, action prefiltering restricts decision-making to feasible low-level actions, enabling low-level heuristics to be evaluated independently of environmental constraints and providing an unbiased assessment. Second, a commitment mechanism regulates the frequency of heuristic switching. We investigate the impact of different commitment strategies, from step-wise switching to full-episode commitment, on both training behavior and makespan. Additionally, we compare two action selection strategies at the policy level: deterministic greedy selection and stochastic sampling. Computational experiments on standard JSSP benchmarks demonstrate that the proposed approach outperforms traditional heuristics, metaheuristics, and recent neural network-based scheduling methods",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "Beyond Model Scaling: Test-Time Intervention for Efficient Deep Reasoning",
      "url": "https://arxiv.org/abs/2601.11252",
      "content": "arXiv:2601.11252v1 Announce Type: new \nAbstract: Large Reasoning Models (LRMs) excel at multi-step reasoning but often suffer from inefficient reasoning processes like overthinking and overshoot, where excessive or misdirected reasoning increases computational cost and degrades performance. Existing efficient reasoning methods operate in a closed-loop manner, lacking mechanisms for external intervention to guide the reasoning process. To address this, we propose Think-with-Me, a novel test-time interactive reasoning paradigm that introduces external feedback intervention into the reasoning process. Our key insights are that transitional conjunctions serve as natural points for intervention, signaling phases of self-validation or exploration and using transitional words appropriately to prolong the reasoning enhances performance, while excessive use affects performance. Building on these insights, Think-with-Me pauses reasoning at these points for external feedback, adaptively extending or terminating reasoning to reduce redundancy while preserving accuracy. The feedback is generated via a multi-criteria evaluation (rationality and completeness) and comes from either human or LLM proxies. We train the target model using Group Relative Policy Optimization (GRPO) to adapt to this interactive mode. Experiments show that Think-with-Me achieves a superior balance between accuracy and reasoning length under limited context windows. On AIME24, Think-with-Me outperforms QwQ-32B by 7.19% in accuracy while reducing average reasoning length by 81% under an 8K window. The paradigm also benefits security and creative tasks.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    },
    {
      "title": "XChoice: Explainable Evaluation of AI-Human Alignment in LLM-based Constrained Choice Decision Making",
      "url": "https://arxiv.org/abs/2601.11286",
      "content": "arXiv:2601.11286v1 Announce Type: new \nAbstract: We present XChoice, an explainable framework for evaluating AI-human alignment in constrained decision making. Moving beyond outcome agreement such as accuracy and F1 score, XChoice fits a mechanism-based decision model to human data and LLM-generated decisions, recovering interpretable parameters that capture the relative importance of decision factors, constraint sensitivity, and implied trade-offs. Alignment is assessed by comparing these parameter vectors across models, options, and subgroups. We demonstrate XChoice on Americans' daily time allocation using the American Time Use Survey (ATUS) as human ground truth, revealing heterogeneous alignment across models and activities and salient misalignment concentrated in Black and married groups. We further validate robustness of XChoice via an invariance analysis and evaluate targeted mitigation with a retrieval augmented generation (RAG) intervention. Overall, XChoice provides mechanism-based metrics that diagnose misalignment and support informed improvements beyond surface outcome matching.",
      "published_date": "2026-01-19T05:00:00",
      "source": "ArXiv AI (Test Source)",
      "source_id": "arxiv_ai",
      "language": "en",
      "credibility_score": 10,
      "relevance_weight": 6,
      "focus_tags": [
        "AI",
        "机器学习",
        "研究论文",
        "算法"
      ]
    }
  ]
}