{
  "timestamp": "2026-01-29T09:49:55.362336",
  "key": "source_reddit_machinelearning_7days",
  "value": [
    {
      "title": "[R] We open-sourced FASHN VTON v1.5: a pixel-space, maskless virtual try-on model trained from scratch (972M params, Apache-2.0)",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qpc4ap/r_we_opensourced_fashn_vton_v15_a_pixelspace/",
      "content": "We just open-sourced FASHN VTON v1.5, a virtual try-on model that generates photorealistic images of people wearing garments directly in pixel space. We trained this from scratch (not fine-tuned from an existing diffusion model), and have been running it as an API for the past year. Now we're releasing the weights and inference code. Why we're releasing this Most open-source VTON models are either research prototypes that require significant engineering to deploy, or they're locked behind restrictive licenses. As state-of-the-art capabilities consolidate into massive generalist models, we think there's value in releasing focused, efficient models that researchers and developers can actually own, study, and extend commercially. We also want to demonstrate that competitive results in this domain don't require massive compute budgets. Total training cost was in the $5-10k range on rented A100s. This follows our human parser release from a couple weeks ago. Architecture  Core: MMDiT (Multi-Modal Diffusion Transformer) with 972M parameters Block structure: 4 patch-mixer + 8 double-stream + 16 single-stream transformer blocks Sampling: Rectified Flow (linear interpolation between noise and data) Conditioning: Person image, garment image, and category (tops/bottoms/one-piece)  Key differentiators Pixel-space operation: Unlike most diffusion models that work in VAE latent space, we operate directly on RGB pixels. This avoids lossy VAE encoding/decoding that can blur fine garment details like textures, patterns, and text. Maskless inference: No segmentation mask is required on the target person. This improves body preservation (no mask leakage artifacts) and allows unconstrained garment volume. The model learns where clothing boundaries should be rather than being told. Practical details  Inference: ~5 seconds on H100, runs on consumer GPUs (RTX 30xx/40xx) Memory: ~8GB VRAM minimum License: Apache-2.0  Links  GitHub: fashn-AI/fashn-vton-1.5 HuggingFace: fashn-ai/fashn-vton-1.5 Project page: fashn.ai/research/vton-1-5  Quick example from fashn_vton import TryOnPipeline from PIL import Image pipeline = TryOnPipeline(weights_dir=\"./weights\") person = Image.open(\"person.jpg\").convert(\"RGB\") garment = Image.open(\"garment.jpg\").convert(\"RGB\") result = pipeline( person_image=person, garment_image=garment, category=\"tops\", ) result.images[0].save(\"output.png\")  Coming soon  HuggingFace Space: Online demo Technical paper: Architecture decisions, training methodology, and design rationale  Happy to answer questions about the architecture, training, or implementation.    submitted by    /u/JYP_Scouter   [link] [comments]",
      "published_date": "2026-01-28T14:00:33",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D] Examples of self taught people who made significant contributions in ML/AI",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qp6s3c/d_examples_of_self_taught_people_who_made/",
      "content": "Most high profile work income across seems to be from people with PhDs, either in academia or industry. There's also a hiring bias towards formal degrees.  There has been a surplus of good quality online learning material and guides about choosing the right books, etc, that a committed and disciplined person can self learn a significant amount.  It sounds good in principle, but has it happened in practice? Are there people with basically a BS/MS in CS or engineering who self taught themselves all the math and ML theory, and went on to build fundamentally new things or made significant contributions to this field?  More personally, I fall in this bucket, and while I'm making good progress with the math, I'd like to know, based on examples of others, how far I can actually go. If self teaching and laboring through a lot of material will be worth it.     submitted by    /u/datashri   [link] [comments]",
      "published_date": "2026-01-28T09:28:43",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D] Why isn't uncertainty estimation implemented in more models?",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qpbrgp/d_why_isnt_uncertainty_estimation_implemented_in/",
      "content": "I have a feeling there must be an obvious answer here. I just came across gaussian process here: https://www.sciencedirect.com/science/article/pii/S2405471220303641 From my understanding, a model that provides a prediction with an uncertainty estimate (that is properly tuned/calibrated for OOD) is immensely useful for the enrichment of results via an acquisition function from screening (for example over the drug perturbation space in a given cell line).  In that paper, they suggest a hybrid approach of GP + MLP. *what drawbacks would this have, other than a slightly higher MSE?*  Although this is not what I'm going for, another application is continued learning: https://www.cell.com/cell-reports-methods/fulltext/S2667-2375(23)00251-5 Their paper doesn't train a highly general drug-drug synergy model, but certianly shows that uncertainty works in practice. I've implemented (deep) ensemble learning before, but this seems more practical than having to train 5 identical models at different initialization parameters - although I may be wrong. Can someone with experience please explain the reason for there not being wisespread adoption? Most (biological) predictive studies don't even mention using it.     submitted by    /u/dp3471   [link] [comments]",
      "published_date": "2026-01-28T13:45:56",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[P] LAD-A2A: How AI agents find each other on local networks",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qpmxvk/p_lada2a_how_ai_agents_find_each_other_on_local/",
      "content": "AI agents are getting really good at doing things, but they're completely blind to their physical surroundings. If you walk into a hotel and you have an AI assistant (like the Chatgpt mobile app), it has no idea there may be a concierge agent on the network that could help you book a spa, check breakfast times, or request late checkout. Same thing at offices, hospitals, cruise ships. The agents are there, but there's no way to discover them. A2A (Google's agent-to-agent protocol) handles how agents talk to each other. MCP handles how agents use tools. But neither answers a basic question: how do you find agents in the first place? So I built LAD-A2A, a simple discovery protocol. When you connect to a Wi-Fi, your agent can automatically find what's available using mDNS (like how AirDrop finds nearby devices) or a standard HTTP endpoint. The spec is intentionally minimal. I didn't want to reinvent A2A or create another complex standard. LAD-A2A just handles discovery, then hands off to A2A for actual communication. Open source, Apache 2.0. Includes a working Python implementation you can run to see it in action. Repo can be found at franzvill/lad. Curious what people think!    submitted by    /u/franzvill   [link] [comments]",
      "published_date": "2026-01-28T20:26:42",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D] aaai 2026 awards feel like a shift. less benchmark chasing, more real world stuff",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qp2yay/d_aaai_2026_awards_feel_like_a_shift_less/",
      "content": "been following the aaai awards this year and something feels different bengio won a classic paper award for his 2011 knowledge base embedding work. 15 years old. but the reason its relevant now is because rag, agents, world models, theyre all basically building on that foundation of embedding structured knowledge into continuous space the outstanding papers are interesting too. theres one on VLA models (vision-language-action) for robotics that doesnt just predict actions but forces the model to reconstruct what its looking at first. basically making sure the robot actually sees the object before trying to grab it. sounds obvious but apparently current VLAs just wing it another one on causal structure learning in continuous time systems. not just fitting curves but actually recovering the causal mechanisms. the authors proved their scoring function isnt just a heuristic, its theoretically grounded feels like the field is moving from \"can we beat sota on this benchmark\" to \"does this actually work in the real world and can we understand why\" been using ai coding tools like verdent and cursor lately and noticing the same pattern. the ones that work best arent necessarily the ones with the biggest models, but the ones that actually understand the structure of what youre building wonder if this is the start of a broader shift or just this years theme    submitted by    /u/Additional-Engine402   [link] [comments]",
      "published_date": "2026-01-28T05:46:41",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[R] Is using rotatary embeddings for ViT becoming standard practice or does everyone still use sinusoidal/learnable embedding",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qpb9zz/r_is_using_rotatary_embeddings_for_vit_becoming/",
      "content": "I'm going through a few MAE papers which I'm trying to copy from about 2+ years ago and it seems that none of them use rotary embedding. They all use sinusoidal or learned. I'm not sure if this is a ViT quirk or if adoption just happened later. The only paper I see that talks about it is this paper which only has like 100 citations. [2403.13298] Rotary Position Embedding for Vision Transformer    submitted by    /u/Affectionate_Use9936   [link] [comments]",
      "published_date": "2026-01-28T13:25:33",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[R] Promising writing improvements in CVPR rebuttal.",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qpe5vq/r_promising_writing_improvements_in_cvpr_rebuttal/",
      "content": "Hello, One of the reviewers of my CVPR paper put as a major concern the structure of a part of my paper. I don’t see how I can answer this. Should I just promise that this will be fixed upon acceptance? Thanks!    submitted by    /u/Training-Adeptness57   [link] [comments]",
      "published_date": "2026-01-28T15:19:07",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D] Evaluating AI Agents for enterprise use: Are standardized benchmarks (Terminal, Harbor, etc.) actually useful for non-tech stakeholders?",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qpom60/d_evaluating_ai_agents_for_enterprise_use_are/",
      "content": "I've been assigned to vet potential AI agents for our ops team. I'm trying to move away from \"vibes-based\" evaluation (chatting with the bot manually) to something data-driven. I’m looking at frameworks like Terminal Bench or Harbor. My issue: They seem great for measuring performance (speed, code execution), but my stakeholders care about business logic and safety (e.g., \"Will it promise a refund it shouldn't?\"). Has anyone here:  Actually used these benchmarks to decide on a purchase? Found that these technical scores correlate with real-world quality? Or do you end up hiring a specialized agency to do a \"Red Team\" audit for specific business cases?  I need something that produces a report I can show to a non-technical VP. Right now, raw benchmark scores just confuse them.    submitted by    /u/External_Spite_699   [link] [comments]",
      "published_date": "2026-01-28T21:29:02",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D] How do you actually track which data transformations went into your trained models?",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qovjyh/d_how_do_you_actually_track_which_data/",
      "content": "I keep running into this problem and wondering if I'm just disorganized or if this is a real gap: The scenario: - Train a model in January, get 94% accuracy - Write paper, submit to conference - Reviewer in March asks: \"Can you reproduce this with different random seeds?\" - I go back to my code and... which dataset version did I use? Which preprocessing script? Did I merge the demographic data before or after normalization? What I've tried: - Git commits (but I forget to commit datasets) - MLflow (tracks experiments, not data transformations) - Detailed comments in notebooks (works until I have 50 notebooks) - \"Just being more disciplined\" (lol) My question: How do you handle this? Do you: 1. Use a specific tool that tracks data lineage well? 2. Have a workflow/discipline that just works? 3. Also struggle with this and wing it every time? I'm especially curious about people doing LLM fine-tuning - with multiple dataset versions, prompts, and preprocessing steps, how do you keep track of what went where? Not looking for perfect solutions - just want to know I'm not alone or if there's something obvious I'm missing. What's your workflow?    submitted by    /u/Achilles_411   [link] [comments]",
      "published_date": "2026-01-28T00:14:44",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D] Some thoughts about an elephant in the room no one talks about",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qo6sai/d_some_thoughts_about_an_elephant_in_the_room_no/",
      "content": "Using a throwaway account for obvious reasons. I am going to say something uncomfortable. A large fraction of senior researchers today care almost exclusively about publications, and they have quietly outsourced their educational/mentorship responsibility to social media. This year’s ICLR has been a bit of a mess, and while there are multiple reasons, this is clearly part of it. The issue is not just OpenReview leak or AC overload. It is that we have systematically failed to train researchers to reason, and the consequences are now visible throughout the system. I have been on both sides of the process for so many times, submitting and reviewing, and the same problems appear repeatedly. Many junior researchers, even those with strong publication records, have never received systematic research training. They are not trained in how to think through design choices, reason about tradeoffs, frame contributions, or evaluate ideas in context. Instead, they are trained to optimize outcomes such as acceptance probability, benchmarks, and reviewer heuristics. There is little shared logic and no long-term vision for the field, only throughput. This vacuum is why social media has become a substitute for mentorship. Every day I see posts asking how to format rebuttals, how the review process works, how to find collaborators, or what reviewers expect. These are reasonable questions, but they should be answered by advisors, not by Reddit, X, or Rednote. And this is not a cultural issue. I read both Chinese and English. The patterns are the same across languages, with the same confusion and surface-level optimization. The lack of research judgment shows up clearly in reviews. I often see authors carefully argue that design choice A is better than design choice B, supported by evidence, only to have reviewers recommend rejection because performance under B is worse. I also see authors explicitly disclose limitations, which should be encouraged, and then see those limitations used as reasons for rejection. This creates perverse incentives where honesty is punished and overclaiming is rewarded. As a reviewer, I have stepped in more than once to prevent papers from being rejected for these reasons. At the same time, I have also seen genuinely weak papers doing incoherent or meaningless things get accepted with positive reviews. This inconsistency is not random. It reflects a community that has not been trained to evaluate research as research, but instead evaluates artifacts competing for acceptance. What makes this especially concerning is that these behaviors are no longer limited to junior researchers. Many of the people enabling them are now senior. Some never received rigorous academic training themselves. I have seen a new PI publicly say on social media that they prefer using LLMs to summarize technical ideas for papers they review. That is not a harmless trick but an unethical violation. I have heard PIs say reading the introduction is a waste of time and they prefer to skim the method. These are PIs and area chairs. They are the ones deciding careers. This is how the current situation emerged. First came LLM hallucinations in papers. Then hallucinations in reviews. Now hallucinations in meta-reviews. This progression was predictable once judgment was replaced by heuristics and mentorship by informal online advice. I am not against transparency or open discussion on social media. But highly specialized skills like research judgment cannot be crowdsourced. They must be transmitted through mentorship and training. Instead, we have normalized learning research through social media, where much of the advice given to junior researchers is actively harmful. It normalizes questionable authorship practices, encourages gaming the system, and treats research like content production. The most worrying part is that this has become normal. We are not just failing to train researchers. We are training the wrong incentives into the next generation. If this continues, the crisis will not be that LLMs write bad papers. The crisis will be that few people remember what good research judgment looks like. We are not there yet. But we are close.    submitted by    /u/DrXiaoZ   [link] [comments]",
      "published_date": "2026-01-27T07:02:16",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D] Who should get co-authorship? Need advice for ICML",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qoaq6r/d_who_should_get_coauthorship_need_advice_for_icml/",
      "content": "Around April 2025, I started working on a paper for ICLR. The plan was to collaborate (equally) with one of my PhD supervisor's students, but as time went on, I took on most of the responsibility and ended up writing the entire paper + coding all the main results and ablations. The other student ran some baselines, but the results had mistakes. So I had to re-implement and correct the baselines. In the final version, everything including writing, code, plots, figures, etc., was my own work. While I was busy with this work, the other student was working on another paper using my code (without including me as a co-author). To be clear: they took my code as a starting point and implemented something on top. I think this was really unfair. Given that we were supposed to collaborate equally, they decided instead to do the minimum to be part of the work while working to get a second paper. My PhD supervisor wasn't involved in most of this process--they usually schedule meetings ~2 weeks before conference deadlines to see what I have ready to submit. I also think this is unfair: I spend hundreds of hours working on a paper, and they get co-authorship by reviewing the abstract. Who should get co-authorship here? From September, I started working on a paper for ICML. I spent so much time on this paper, not taking Christmas holiday, etc. I was expecting the same request for a meeting two weeks before the deadline, but this time, one day before the Abstract deadline, my supervisor asks me \"What are we submitting to ICML?\" Keep in mind, we haven't spoken since the ICLR deadline and they have no idea what I have been working on. I wasn't sure what to do, but I ended up adding them as a co-author. I really regret this decision. Should they get co-authorship just for being a supervisor? If there was an option to remove them, for example, by emailing PCs, should I do it?    submitted by    /u/NumberGenerator   [link] [comments]",
      "published_date": "2026-01-27T10:56:09",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[P] Distributed training observability for Pytorch",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qopnd6/p_distributed_training_observability_for_pytorch/",
      "content": "Hi, I have been building TraceML, an open-source tool for low-overhead observability in distributed PyTorch training, and just pushed an update adding single-node DDP support. It focuses on making common distributed bottlenecks visible without heavy profilers: Step time (median / worst / per-rank) Dataloader fetch time GPU memory usage Rank-aware metrics for DDP Design goals: drop-in instrumentation (no model rewrite) low overhead (meant to stay enabled) explicit distributed semantics (worst-rank vs averages) This ISN'T a replacement for PyTorch Profiler or Nsight. It is meant as always-on telemetry to answer questions like “which rank is the straggler?” or “are GPUs idle due to dataloader or sync?” Repo: https://github.com/traceopt-ai/traceml Demo: https://www.loom.com/share/de274cbfb49e4f24b4d1d2c7f6a12705 Feedback are most welcome, especially from people debugging performance issues in distributed training.    submitted by    /u/traceml-ai   [link] [comments]",
      "published_date": "2026-01-27T20:32:02",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D] Data labelling problems",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qomzj3/d_data_labelling_problems/",
      "content": "What kind of data labelling issues do you face most often? Where do current tools fall short? For me, I’m on a small, newly formed AI team where we have data, but we have no labelling time from SMEs. We use Label Studio as it’s very customisable and Product have no idea what they want yet. It’s self hosted as our data is highly sensitive. I already have some gripes about Label Studio: • Poor search for high-cardinality categorical labels • Review, role management etc. limited to the Enterprise plan • No ability to hide existing labels from additional labellers to avoid anchoring bias • I could go on Curious to hear others’ experiences.    submitted by    /u/Lexski   [link] [comments]",
      "published_date": "2026-01-27T18:58:38",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D]] CVPR 2026 Rebuttal- Additional page for references?",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qonq7k/d_cvpr_2026_rebuttal_additional_page_for/",
      "content": "Was drafting CVPR Rebuttal (after convincing myself to give a shot for days) and one of the reviewers had asked us to provide evidence for a particular statement, so we are planning to cite papers for it. Are we allowed to use additional page for references? Thanks    submitted by    /u/Forsaken-Order-7376   [link] [comments]",
      "published_date": "2026-01-27T19:23:59",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Advice for PhD students in this Al slop paper era - I feel academia needs serious revisions! [D]",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qno68x/advice_for_phd_students_in_this_al_slop_paper_era/",
      "content": "Looking at 30k submissions at a single conference venue and also recent AI written paper with AI written reviews - I'm seriously worried about where this is heading. i decided to pursue a PhD because I really liked working on papers for months, get very interesting clinical findings and then present it really well. But I feel that it is dead now. All recent papers I read in my field are just slops and there is no real work coming out worth reading. Even if there is, it gets lost in the pile. What advice do you want to give to PhD students like me on how to maximize their PhD as just getting papers at venues is a lost dream. My aim is to get into a big tech, working on real problems.    submitted by    /u/ade17_in   [link] [comments]",
      "published_date": "2026-01-26T18:22:21",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D] Will there be a rebuttal period for ICML 2026? No dates listed on website",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qoia2h/d_will_there_be_a_rebuttal_period_for_icml_2026/",
      "content": "Hi everyone, I noticed that the ICML 2026 dates page doesn't mention anything about an author rebuttal period, even though previous years have always had one. Does anyone know if:  They're just late updating the website with the full timeline? There's been an announcement about removing the rebuttal period this year?  Seems unusual to have submission and notification dates but nothing about rebuttals. Want to make sure I'm not missing anything important.    submitted by    /u/Leno3_0   [link] [comments]",
      "published_date": "2026-01-27T16:16:54",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[D] ICML reciprocal reviewer queries",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qo4a1r/d_icml_reciprocal_reviewer_queries/",
      "content": "I received an email outlining the qualifications for a reciprocal reviewer, specifically requiring an individual to be the primary author on \"at least two\" publications accepted at ICML, ICLR, or NeurIPS conferences. This requirement presents a significant challenge for new PhD students and even recently appointed professors. In my current situation, I anticipate a high likelihood of desk rejection due to the limited timeframe available to identify suitable candidates. Is this a typical expectation for such conferences? I would appreciate any suggestions you may have, especially considering the submission deadline of January 27th.    submitted by    /u/SnooPears3186   [link] [comments]",
      "published_date": "2026-01-27T04:51:03",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "[2510.01265] RLP: Reinforcement as a Pretraining Objective",
      "url": "https://www.reddit.com/r/MachineLearning/comments/1qnqfuh/251001265_rlp_reinforcement_as_a_pretraining/",
      "content": "Really interesting piece came out of Nvidia Labs. Abstract: The dominant paradigm for training large reasoning models starts with pre-training using next-token prediction loss on vast amounts of data. Reinforcement learning, while powerful in scaling reasoning, is introduced only as the very last phase of post-training, preceded by supervised fine-tuning. While dominant, is this an optimal way of training? In this paper, we present RLP, an information-driven reinforcement pretraining objective, that brings the core spirit of reinforcement learning -- exploration -- to the last phase of pretraining. The key idea is to treat chain-of-thought as an exploratory action, with rewards computed based on the information gain it provides for predicting future tokens. This training objective essentially encourages the model to think for itself before predicting what comes next, thus teaching an independent thinking behavior earlier in the pretraining. More concretely, the reward signal measures the increase in log-likelihood of the next token when conditioning on both context and a sampled reasoning chain, compared to conditioning on context alone. This approach yields a verifier-free dense reward signal, allowing for efficient training for the full document stream during pretraining. Specifically, RLP reframes reinforcement learning for reasoning as a pretraining objective on ordinary text, bridging the gap between next-token prediction and the emergence of useful chain-of-thought reasoning. Pretraining with RLP on Qwen3-1.7B-Base lifts the overall average across an eight-benchmark math-and-science suite by 19%. With identical post-training, the gains compound, with the largest improvements on reasoning-heavy tasks such as AIME25 and MMLU-Pro. Applying RLP to the hybrid Nemotron-Nano-12B-v2 increases the overall average from 42.81% to 61.32% and raises the average on scientific reasoning by 23%, demonstrating scalability across architectures and model sizes.     submitted by    /u/blueredscreen   [link] [comments]",
      "published_date": "2026-01-26T19:38:14",
      "source": "r/MachineLearning",
      "source_id": "reddit_machinelearning",
      "language": "en",
      "credibility_score": 7,
      "relevance_weight": 5,
      "focus_tags": []
    }
  ]
}