{
  "timestamp": "2026-02-02T10:04:17.968426",
  "key": "source_the_verge_ai_7days",
  "value": [
    {
      "title": "Shedding light on Iran’s longest internet blackout",
      "url": "https://www.theverge.com/policy/871848/iran-blackout-internet-mahsa-alimardani",
      "content": "After protests broke out in early January, the Iranian regime shut down the internet, starting the longest blackout in Iranian history. Despite this attempt to stop the protests from spreading, they did not stop. Still, the internet shutdown slowed down the spread of information both inside and outside Iran. Behind the heavily policed borders and […]",
      "published_date": "2026-02-01T18:30:00",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Nvidia CEO denies he’s ‘unhappy’ with OpenAI",
      "url": "https://www.theverge.com/tech/871818/nvidia-ceo-jensen-huang-unhappy-openai",
      "content": "Nvidia's CEO Jensen Huang denied reports that he was unhappy with OpenAI and said his company still planned to make a \"huge\" investment in the ChatGPT firm. NVIDIA announced in September that it would invest up to $100 billion in OpenAI, but recently, there have been suggestions that the deal might not happen. While Huang […]",
      "published_date": "2026-01-31T23:37:56",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "SpaceX wants to put 1 million solar-powered data centers into orbit",
      "url": "https://www.theverge.com/tech/871641/spacex-fcc-1-million-solar-powered-data-centers-satellites-orbit",
      "content": "SpaceX filed a request with the FCC on Friday seeking approval to put a constellation of 1 million data center satellites into orbit. While the FCC is unlikely to approve a network that expansive, SpaceX's strategy has been to request approval for unrealistically large numbers of satellites as a starting point for negotiations. The filing […]",
      "published_date": "2026-01-31T19:38:36",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "ChatGPT isn’t the only chatbot pulling answers from Elon Musk’s Grokipedia",
      "url": "https://www.theverge.com/report/870910/ai-chatbots-citing-grokipedia",
      "content": "ChatGPT is using Grokipedia as a source, and it's not the only AI tool to do so. Citations to Elon Musk's AI-generated encyclopedia are starting to appear in answers from Google's AI Overviews, AI Mode, and Gemini, too. Data suggests that's on the rise, heightening concerns about accuracy and misinformation as Musk seeks to reshape […]",
      "published_date": "2026-01-31T13:00:00",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Video game company stock prices dip after Google introduces an AI world-generation tool",
      "url": "https://www.theverge.com/games/871348/google-project-genie-take-two-roblox-unity",
      "content": "The stock prices of some major video game companies, including Take-Two Interactive, Roblox, and Unity, had notable declines on Friday, just a day after Google announced its Project Genie tool that lets users prompt AI to generate interactive experiences, Reuters reports. Take-Two's stock price closed at $220.30 (down 7.93 percent from yesterday), Roblox's closed at […]",
      "published_date": "2026-01-30T22:45:16",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "There’s a social network for AI agents, and it’s getting weird",
      "url": "https://www.theverge.com/ai-artificial-intelligence/871006/social-network-facebook-for-ai-agents-moltbook-moltbot-openclaw",
      "content": "Yes, you read that right. \"Moltbook\" is a social network of sorts for AI agents, particularly ones offered by OpenClaw (a viral AI assistant project that was formerly known as Moltbot, and before that, known as Clawdbot - until a legal dispute with Anthropic). Moltbook, which is set up similarly to Reddit and was built […]",
      "published_date": "2026-01-30T19:11:35",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "It’s a new heyday for gas thanks to data centers",
      "url": "https://www.theverge.com/news/870422/data-center-ai-gas-power-surge",
      "content": "The US is now leading a global surge in new gas power plants being built in large part to satisfy growing energy demand for data centers. And more gas means more planet-heating pollution. Gas-fired power generation in development globally rose by 31 percent in 2025. Almost a quarter of that added capacity is slated for […]",
      "published_date": "2026-01-29T22:12:49",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Elon Musk might merge SpaceX with Tesla or xAI",
      "url": "https://www.theverge.com/tech/870380/elon-musk-space-x-xai-merger",
      "content": "Elon Musk-led SpaceX may merge with another company helmed by Elon Musk. Reuters initially reported Thursday that SpaceX and xAI are \"in discussions to merge\" ahead of SpaceX's IPO that's planned for later this year. The merger would help with SpaceX's plans to launch data centers into space, according to the publication. Later on Thursday, […]",
      "published_date": "2026-01-29T19:47:58",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Apple’s second biggest acquisition ever is an AI company that listens to ‘silent speech’",
      "url": "https://www.theverge.com/news/870353/apple-q-ai-acquisition-silent-speech",
      "content": "Apple's biggest acquisition ever is still its $3 billion Beats buy in 2014, but now the second biggest deal is bringing in Q.ai, a four-year-old AI audio startup. Apple did not disclose the terms, but Financial Times reports that Apple is spending $2 billion on the company. It also mentioned Q.ai patents for optical sensor […]",
      "published_date": "2026-01-29T19:22:27",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Half of developers think gen AI is bad for the gaming industry",
      "url": "https://www.theverge.com/entertainment/869386/ai-game-development-gdc-survey",
      "content": "While generative AI is being adopted at various levels of game development, a new survey suggests that developers increasingly think the technology is bad for the industry. According to the most recent survey from the Game Developers Conference, 52 percent of respondents said that gen AI is having a \"negative\" impact on the games industry, […]",
      "published_date": "2026-01-29T17:00:00",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    }
  ]
}