{
  "timestamp": "2026-01-29T09:49:50.863865",
  "key": "source_the_verge_ai_7days",
  "value": [
    {
      "title": "Mark Zuckerberg is all in on AI as the new social media",
      "url": "https://www.theverge.com/news/869882/mark-zuckerberg-meta-earnings-q4-2025",
      "content": "Meta CEO Mark Zuckerberg's metaverse dreams seem to have been replaced by a new vision: an AI-generated social feed. In an earnings call on Wednesday, Zuckerberg reiterated his belief that AI will become the next big media format, making feeds \"more immersive and interactive:\" We started with text, and then moved to photos when we […]",
      "published_date": "2026-01-28T23:26:41",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Google adds Gemini AI-powered ‘auto browse’ to Chrome",
      "url": "https://www.theverge.com/news/869731/google-gemini-ai-chrome-auto-browse",
      "content": "Google is launching a new \"auto browse\" feature inside Chrome that can perform multi-step tasks on your behalf. The Gemini AI-powered capability is coming to Google AI Pro and Ultra subscribers in the US, and can do things like research hotel and flight costs, schedule appointments, fill out online forms, manage subscriptions, and more. The […]",
      "published_date": "2026-01-28T21:32:07",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "YouTube&#8217;s top AI slop channels are disappearing",
      "url": "https://www.theverge.com/news/869684/youtube-top-ai-channels-removed-kapwing",
      "content": "YouTube appears to have taken down two of the most popular AI slop channels on its platform, along with several others. A report from Kapwing found that a channel called CuentosFacianantes no longer exists on the platform after amassing more than 5.9 million subscribers and over 1.2 billion total views. In a November 2025 report, […]",
      "published_date": "2026-01-28T20:47:25",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "I used Claude to vibe-code my wildly overcomplicated smart home",
      "url": "https://www.theverge.com/report/869318/claude-vibe-coding-home-assistant-smart-home",
      "content": "I am not, by any definition, a coder, but when I started seeing people's vibe-coded smart home projects all over my social feeds this month, I was intrigued. From a \"master command center\" built on a Lutron system to AI controlling a smart oven, people were unleashing AI in their smart homes, using Claude Code […]",
      "published_date": "2026-01-28T20:00:00",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Grok is the most antisemitic chatbot according to the ADL",
      "url": "https://www.theverge.com/news/868925/adl-ai-antisemitism-report-grok-chatgpt-gemini-claude-deepseek-llama-elon-musk",
      "content": "Across six top large language models, xAI's Grok performed the worst at identifying and countering antisemitic content, according to a study published Wednesday by the Anti-Defamation League. On the other end of the spectrum, Anthropic's Claude performed the best according to the report's metrics, but the ADL said all models had gaps that required improvement. […]",
      "published_date": "2026-01-28T12:00:00",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Astronomers used AI to find 1,400 ‘anomalous objects’ from Hubble archives",
      "url": "https://www.theverge.com/news/869182/astronomers-ai-discover-cosmic-anomalies-hubble-archives",
      "content": "A pair of astronomers at the European Space Agency (ESA) discovered more than 800 previously undocumented \"astrophysical anomalies\" hiding in Hubble's archives. To do so, researchers David O'Ryan and Pablo Gómez trained an AI model to comb through Hubble's 35-year dataset, hunting for strange objects and flagging them for manual review. It's \"a treasure trove […]",
      "published_date": "2026-01-28T11:15:37",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Meta is spending millions to convince people that data centers are cool and you like them",
      "url": "https://www.theverge.com/news/869008/meta-data-centers-ad-campaign",
      "content": "Over the last few months of 2025, Meta spent $6.4 million on an ad campaign running in cities across the country, from Sacramento to Washington, with a clear mission: win over viewers on the construction of new data centers. As the New York Times reports, the ad campaign is anchored by short, folksy video spotlights […]",
      "published_date": "2026-01-27T23:53:53",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Moltbot, the AI agent that &#8216;actually does things,&#8217; is tech’s new obsession",
      "url": "https://www.theverge.com/report/869004/moltbot-clawdbot-local-ai-agent",
      "content": "An open-source AI agent that \"actually does things\" is taking off, with people across the web sharing how they're using the agent to do a whole bunch of things, like manage reminders, log health and fitness data, and even communicate with clients. The tool, called Moltbot (formerly Clawdbot), runs locally on a variety of devices, […]",
      "published_date": "2026-01-27T23:28:11",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "The winter storm tested power grids straining to accommodate AI data centers",
      "url": "https://www.theverge.com/report/868859/electricity-rates-power-grid-ai-data-center-winter-storm",
      "content": "The colossal winter storm that swept across 34 states left hundreds of thousands of people without electricity. Bitterly cold temperatures lingering after Winter Storm Fern are still testing power grids, already under stress from a rush of new AI data centers. Over the weekend, wholesale electricity prices soared in Virginia, the state with the most […]",
      "published_date": "2026-01-27T22:28:58",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Google Search now lets you ask AI Overviews follow-up questions",
      "url": "https://www.theverge.com/news/868497/google-ai-search-follow-up-questions-gemini-3",
      "content": "Google is making Search less about links and more about AI. The company is upgrading its AI-powered search features, adding Gemini 3 to AI Overviews and letting users ask follow-up questions \"seamlessly\" to make sure Search can answer \"whatever's on your mind,\" a move that feels closer to using an AI chatbot than a search […]",
      "published_date": "2026-01-27T17:00:00",
      "source": "The Verge AI",
      "source_id": "the_verge_ai",
      "language": "en",
      "credibility_score": 9,
      "relevance_weight": 5,
      "focus_tags": []
    }
  ]
}