{
  "timestamp": "2026-02-02T10:04:21.480033",
  "key": "source_reddit_singularity_7days",
  "value": [
    {
      "title": "NVIDIA just dropped a banger paper on how they compressed a model from 16-bit to 4-bit and were able to maintain 99.4% accuracy, which is basically lossless.",
      "url": "https://www.reddit.com/r/singularity/comments/1qr152m/nvidia_just_dropped_a_banger_paper_on_how_they/",
      "content": "submitted by    /u/Worldly_Evidence9113   [link] [comments]",
      "published_date": "2026-01-30T09:46:42",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Project Genie | Experimenting with infinite interactive worlds",
      "url": "https://www.reddit.com/r/singularity/comments/1qqe3wv/project_genie_experimenting_with_infinite/",
      "content": "submitted by    /u/141_1337   [link] [comments]",
      "published_date": "2026-01-29T16:57:00",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Robot struggles to shovel snow",
      "url": "https://www.reddit.com/r/singularity/comments/1qt9cbh/robot_struggles_to_shovel_snow/",
      "content": "submitted by    /u/Old-School8916   [link] [comments]",
      "published_date": "2026-02-01T20:12:43",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Sonnet 5 next week?",
      "url": "https://www.reddit.com/r/singularity/comments/1qtc4jg/sonnet_5_next_week/",
      "content": "x.com/chetaslua/status/2018048507417075794?s=46 From the post: > 1 million context > 1/2 the price of opus 4.5 < better in all area> > trained on TPUs >Faster will mogs every model in agentic coding  model information from Vertex, Sonnet 5 is expected to be released as early as next week.    submitted by    /u/policyweb   [link] [comments]",
      "published_date": "2026-02-01T21:57:09",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Shanghai scientists create computer chip in fiber thinner than a human hair, yet can withstand crushing force of 15.6 tons",
      "url": "https://www.reddit.com/r/singularity/comments/1qt28no/shanghai_scientists_create_computer_chip_in_fiber/",
      "content": "Scientists at Fudan University in Shanghai have developed a flexible fiber chip as thin as a human hair (approximately 50–70 micrometers) that remains functional after being crushed by a 15.6-ton container truck.  Key Features of the Fiber Chip Transistor Density: The fiber integrates up to 100,000 transistors per centimeter. A one-meter strand has processing power comparable to a classic computer CPU. \"Sushi Roll\" Design: Unlike traditional rigid silicon chips, researchers used a multilayered spiral architecture, rolling thin circuit layers onto an elastic substrate like a sushi roll to maximize internal space. Extreme Durability: Beyond withstanding 15.6 tons of pressure, the fiber can survive 10,000 bending cycles, stretching by 30%, and temperatures up to 100°C. It is also machine-washable. Applications: The technology is intended for smart textiles (clothing that acts as a computer), brain-computer interfaces (BCIs) due to its softness and immersive VR gloves that provide tactile feedback.  Source: Tom's Hardware / SCMP    submitted by    /u/BuildwithVignesh   [link] [comments]",
      "published_date": "2026-02-01T16:00:34",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "World’s first downward-drilling autonomous robot drills data centers 10× faster with 99.97% accuracy",
      "url": "https://www.reddit.com/r/singularity/comments/1qsxvty/worlds_first_downwarddrilling_autonomous_robot/",
      "content": "Amidst a rapid expansion of more than 400 data centers in development around the world, US Power manufacturer DEWALT in collaboration with August Robotics has unveiled an autonomous, fleet-capable, downward-drilling robot. This innovation specifically addresses the labor shortage and high-precision requirements of constructing modern, large-scale data centers.  Source: DEWALT     submitted by    /u/BuildwithVignesh   [link] [comments]",
      "published_date": "2026-02-01T13:01:54",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Things are just starting to get very very wild: moltbots are twitch streaming",
      "url": "https://www.reddit.com/r/singularity/comments/1qtf553/things_are_just_starting_to_get_very_very_wild/",
      "content": "I'm sure there are more than one doing this. You can join and actually chat with them as they build and do stuff. Cray cray edit: you can google for them. I don't want to astroturf stuff    submitted by    /u/kaggleqrdl   [link] [comments]",
      "published_date": "2026-02-01T23:57:27",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "I'm not convinced that the doomer, dystopian, mass job loss, scenario, is even moderately likely.",
      "url": "https://www.reddit.com/r/singularity/comments/1qtg43o/im_not_convinced_that_the_doomer_dystopian_mass/",
      "content": "One thing about humans is we are EXTREMELY adaptive. No matter the challenge, no matter how unforseen, we always seem to adapt. We figure out novel, new systems, no matter the challenge to get through it. I mean, it's how we got here after all.  But that said, I just don't see the mechanics required for that future to even be in place, so I don't even see it as a viable concern. Here me out:  First, above all, humans demand accountability. No matter what, we're ultimately going to want to coordinate and delegate to humans. We need someone responsible for things, who thinks like a human, and feels like a human... Ultimately, we will always want someone accountable when things go right or wrong.  Second, people insist that if a team of 5 can be replaced by a single person and swarm of AI, then they'll just fire 4 engineers. This is just ridiculous IMO... We run businesses for productivity and profit. If we have a team of 5, we dont fire 4. Instead we just give each person their own AI system, and now become 5x more productive. We will scale quicker, larger, and innovate. We wont downsize and retain the same productivity, instead we'll just multiply our productivity.  Third, institutions aren't going to just sit by and let their system that they make money off of, just vanish. Those in power still want the status quo. They aren't going to just disrupt the whole system, take these huge risks, while they are already doing great. Again, they'll rather KEEP the status quo, and opt to make it even more powerful and productive.  Fourth, structurally it's impossible. We move slow... We have beuracracy, and culture takes time time to adapt. We just wont let everything fall apart over night, have mass unrest, etc etc... We don't have the infrastructure to just rapidly drop EVERYTHING, the entire way of doing things, and switch over. It's going to necessistate a slow transition. And as that transition is happening, we'll be innovating, figuring out new systems, adapting, and so on. Finally, politically it wont happen. This should be obvious. We'll just start voting in politicians who have a plan soon as unrest begins. The last thing the elites and politicians are going to be okay with is a bunch of hungry people with pitchforks. No stable government will permit 40% unemployment if it wishes to remain in power. The whole point of \"The New Deal\" was a new deal between labor and capital, as the elites and government saw the writing on the wall: If they want to continue to exist, it's time to make a new deal, else it's going to get very French, very fast.   Here's what I think is most likely: There's going to be a massive innovation boom. Now that the barrier for entry continues to dramatically reduce, more and more people will be able to turn their ideas into reality. This will, no matter how you frame it, inherently create more jobs all over the place. It'll just be a huge productivity and innovation boom as more and more people are able to start actually running businesses and building products. The barrier to entry for starting a company will grow closer to near zero, so the \"Long Tail\" of the economy will explode. Every single tiny mundane niche you can think of, will suddenly have enormous amounts of innovation and work being poured into it.  In a competitive market, a company that keeps all 5 engineers and produces 5x the features will likely outcompete the company that stays stagnant but cuts costs. When the spreadsheet (Excel) was introduced, the number of bookkeepers dropped, but the number of accountants and financial analysts skyrocketed. We didn't do less accounting; we did more complex, high-level analysis. This is called Jevons Paradox. For instance, if we made energy 10x cheaper, we wouldn't just have a 10x cheaper power bill... We'd actually just end up finding a way to use 10x the amount of energy. This is the concept of \"If you build it, they will come\". You create the infrastructure and access to resources, people will find a way to maximize it. We're never really in a state of abundance. We always maximize available resources.  AI companies are going to get better and better and making AI suits more useful for businesses. Right now it's still really techy outside things like chatbots. It's not easy for most normies to just pick up AI and use it in a more technical sense, and even if they can, it's also a bit risky. But as time goes on, startups are going to be building industry/niche specific AI packages that are meant to easy and useful for regular workers, making it easier to integrate in all different parts of the labor force.  I think it's not going to replace people, as much as it's just going to make them far more productive, and their jobs easier. People will slowly begin shifting away from doing the hardwork themselves, and be more of the \"big picture\" idea people, who direct, and guide AI, in all aspects of the workforce. And this will only continue to progress. I think this will actually cause wages to rise. As companies become more and more profitable, they'll want to grow more and more, which will require more hiring... And this will be global. There will be a global boom in growth due to the rapid increase in productivity. Companies will start becoming so flush with cash, they'll be fighting for more people to come help them play their role of accountability and managing every more powerful AI systems.  Meanwhile, prices will start falling. Again, huge surplusses will emerge, that are also far cheaper to produce, this will naturally start causing prices to lower.  I basically see a future where this transition will be relatively slow compared to how some imagine a \"take off\" scenario. And while that transition happens, we'll be able to adapt because the boundaries of the real world is going to fundamentally force it not move so fast as we can't keep up. The \"World of Atoms\" moves significantly slower than the \"World of Bits.\" Natural selection will slowly start picking discovering a new, stable, prosperous solution.    submitted by    /u/reddit_is_geh   [link] [comments]",
      "published_date": "2026-02-02T00:38:41",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "OpenAI is rolling out beta ads on ChatGPT with a minimum of $200k from selected advertisers",
      "url": "https://www.reddit.com/r/singularity/comments/1qsvvbg/openai_is_rolling_out_beta_ads_on_chatgpt_with_a/",
      "content": "For some brands, ad testing starts as early as February 6. OpenAI is asking select advertisers to commit at least $200,000 as it rolls out beta ads on ChatGPT, the company confirmed to ADWEEK. The beta is small and tightly controlled. An OpenAI spokesperson said the limited scope of the test is deliberate, intended to see what types of ads provide value for users, with pricing at $60 CPM. The company added that it plans to introduce additional ad formats and buying models over time, once it determines how advertising can be integrated in a more additive way, but declined to provide specifics. Four clients represented by search intelligence platform Adthena were approached for $250,000. Source: Adweek (Exclusive)    submitted by    /u/BuildwithVignesh   [link] [comments]",
      "published_date": "2026-02-01T11:16:46",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Moltbook fake posts!",
      "url": "https://www.reddit.com/r/singularity/comments/1qthdcj/moltbook_fake_posts/",
      "content": "Turns put you can just post as a human through the backend of moltbook if you provide an API key.    submitted by    /u/artemisgarden   [link] [comments]",
      "published_date": "2026-02-02T01:34:12",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Anthropic positions itself as the AI sector's superego, but caught between the pressures while being commercially successful",
      "url": "https://www.reddit.com/r/singularity/comments/1qssyk0/anthropic_positions_itself_as_the_ai_sectors/",
      "content": "Anthropic positions itself as the AI sector's superego, but caught between the pressures to be safe, fast & rigorous while being commercially successful Source: The Atlantic Report     submitted by    /u/BuildwithVignesh   [link] [comments]",
      "published_date": "2026-02-01T08:28:06",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Moltbook viral posts where AI Agents are conspiring against humans are mostly fake",
      "url": "https://www.reddit.com/r/singularity/comments/1qsibsj/moltbook_viral_posts_where_ai_agents_are/",
      "content": "submitted by    /u/WPHero   [link] [comments]",
      "published_date": "2026-01-31T23:49:36",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "UN warns of \"Permanent Al Labor Decoupling\" by late 2026; India flags risk of 2008-style global financial crisis",
      "url": "https://www.reddit.com/r/singularity/comments/1qs85gq/un_warns_of_permanent_al_labor_decoupling_by_late/",
      "content": "A series of high-level economic reports released today (Jan 31) suggest we are hitting the steep part of the curve. The United Nations just issued a warning that Al is no longer just \"transformative\" but is now creating a real risk of widening social and economic divides as job losses accelerate. Simultaneously, India's Economic Survey 2025- 26 (tabled Jan 29-31) has officially flagged a 10- 20% probability of a global financial crisis in 2026 that could be worse than 2008. Key Structural Shifts: The Decoupling: UN experts are shifting focus from upskilling to \"transition management\" acknowledging that workers may not be able to compete with machines at scale by Q4 2026. Asset Bubbles: Economists at the Russia National Centre forum today highlighted Al- driven market volatility as one of the top five megatrends threatening global stability ACN Newswire. Market Reality Check: Gold and silver hit record highs this morning before a sharp sell- off, signaling that investors are retreating to safe havens in anticipation of a \"tech bubble\" correction later this year MoneyControl Global Crisis Risk    submitted by    /u/BuildwithVignesh   [link] [comments]",
      "published_date": "2026-01-31T17:17:23",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "IRON makes another appearance after XPENG announced that its first prototype unit has successfully rolled off the production line, achieving automotive-grade standards eyeing mass production this year",
      "url": "https://www.reddit.com/r/singularity/comments/1qrzo26/iron_makes_another_appearance_after_xpeng/",
      "content": "submitted by    /u/Distinct-Question-16   [link] [comments]",
      "published_date": "2026-01-31T11:11:23",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "AI Boom Is Triggering a Loan Meltdown for Software Companies: Credit Weekly",
      "url": "https://www.reddit.com/r/singularity/comments/1qsdifl/ai_boom_is_triggering_a_loan_meltdown_for/",
      "content": "Amid strong credit market sentiment, software debt is coming under pressure. Software companies that took on heavy debt during leveraged buyouts are seeing loan prices fall as investors worry that rapid advances in AI including Anthropic’s Claude could make many software products obsolete. A Cloudera loan dropped 7 cents on the dollar this week, with declines also hitting loans tied to Dayforce, Rocket Software and others. European software firm Team.Blue and Thoma Bravo’s Conga have struggled to raise new debt amid heavy loan selling. Software accounts for about 12% of the US leveraged loan market and is currently the worst-performing sector, according to Nomura. According to Creditweekly Report (Via Bloomberg)    submitted by    /u/BuildwithVignesh   [link] [comments]",
      "published_date": "2026-01-31T20:36:39",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "NVIDIA's Huang said it was “nonsense” to say he was unhappy with OpenAI.",
      "url": "https://www.reddit.com/r/singularity/comments/1qs4hhz/nvidias_huang_said_it_was_nonsense_to_say_he_was/",
      "content": "Source: https://www.cnbc.com/2026/01/31/nvidia-ceo-huang-denies-hes-unhappy-with-openai.html    submitted by    /u/thatguyisme87   [link] [comments]",
      "published_date": "2026-01-31T14:58:11",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Mark Gurman: \"Apple runs on Anthropic at this point. Anthropic is powering a lot of the stuff Apple is doing internally in terms of product development, a lot of their internal tools…They have custom versions of Claude running on their own servers internally.\"",
      "url": "https://www.reddit.com/r/singularity/comments/1qs0ioh/mark_gurman_apple_runs_on_anthropic_at_this_point/",
      "content": "submitted by    /u/likeastar20   [link] [comments]",
      "published_date": "2026-01-31T11:58:36",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "SpaceX files plans for million-satellite orbital data center constellation",
      "url": "https://www.reddit.com/r/singularity/comments/1qs59ng/spacex_files_plans_for_millionsatellite_orbital/",
      "content": "submitted by    /u/FakeEyeball   [link] [comments]",
      "published_date": "2026-01-31T15:28:47",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "Thanks to Claude Opus 4.5, I will be getting third place in a data compression challenge hosted by comma.ai for job hiring! Also, I have released my code so that others could learn from this experience.",
      "url": "https://www.reddit.com/r/singularity/comments/1qs67oa/thanks_to_claude_opus_45_i_will_be_getting_third/",
      "content": "submitted by    /u/Unusual_Midnight_523   [link] [comments]",
      "published_date": "2026-01-31T16:05:27",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    },
    {
      "title": "The $100 Billion Megadeal Between OpenAI and Nvidia Is on Ice, \"Jensen Huang has privately criticized what he has described as a lack of discipline in OpenAI’s business approach and expressed concern about the competition it faces from the likes of Google and Anthropic, some of the people said.\"",
      "url": "https://www.reddit.com/r/singularity/comments/1qrs2oi/the_100_billion_megadeal_between_openai_and/",
      "content": "https://archive.is/iOuh5    submitted by    /u/Nikvest   [link] [comments]",
      "published_date": "2026-01-31T04:07:26",
      "source": "r/singularity",
      "source_id": "reddit_singularity",
      "language": "en",
      "credibility_score": 6,
      "relevance_weight": 5,
      "focus_tags": []
    }
  ]
}